{"meta":{"title":"Jerry's Blog","subtitle":"Jerry的博客","description":"Live a valuable life!","author":"Jerry Chen","url":"https://jerrynju.github.io"},"pages":[{"title":"相册","date":"2018-01-12T06:12:56.000Z","updated":"2018-01-13T04:46:28.098Z","comments":true,"path":"photos/index.html","permalink":"https://jerrynju.github.io/photos/index.html","excerpt":"","text":""},{"title":"分类","date":"2018-01-14T11:04:02.000Z","updated":"2018-01-14T11:04:59.894Z","comments":false,"path":"categories/index.html","permalink":"https://jerrynju.github.io/categories/index.html","excerpt":"","text":""},{"title":"标签云","date":"2018-01-14T11:00:38.000Z","updated":"2018-01-14T11:05:03.375Z","comments":false,"path":"tags/index.html","permalink":"https://jerrynju.github.io/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"test.md","slug":"test-md","date":"2018-01-14T10:43:49.000Z","updated":"2018-01-14T10:43:49.732Z","comments":true,"path":"2018/01/14/test-md/","link":"","permalink":"https://jerrynju.github.io/2018/01/14/test-md/","excerpt":"","text":"","categories":[],"tags":[]},{"title":"关于英语学习的思考","slug":"对英语学习方式的思考","date":"2018-01-14T10:43:49.000Z","updated":"2018-01-14T11:03:27.999Z","comments":true,"path":"2018/01/14/对英语学习方式的思考/","link":"","permalink":"https://jerrynju.github.io/2018/01/14/对英语学习方式的思考/","excerpt":"","text":"特殊的学科英语是一门很特殊的学科，正如著名语言学家Greg Thomson所说：“外语学习的原理是如此之复杂，以至于没有人能说清楚；但掌握语言的过程又是如此之简单，以至于不需要说清楚。”人们乐此不疲的耗费着大量的时间去学习英语。对英语的热衷覆盖了人生的各个阶段。在学校里上学的时段自不必说，英语是与语文、数学并列的三大主课之一。往前推，各式各样的少儿英语培训热火朝天，家长们恨不得从小孩一出生就开始学英语。往后推，考研、考博、出国留学必然是离不开英语，就连已经工作的职场人士也有英孚之类的针对性培训机构。学习时间跨度如此之长的学科恐怕找不到第二个。然而大多数人的学习效率是非常低的。正如很多大学生自嘲，高考结束的那天是自己一生中英语水平最高的时刻。为什么在英语这门学科身上有这么多矛盾，甚至荒诞的现象？本文试着做一些严肃的分析。 为什么学英语在讨论怎么学英语之前，我们先问一个更为基本的问题：我们为什么要学英语？这个问题往往在刚接触英语学习的初中阶段困扰过一些中学生，但是到了大学阶段以后，几乎再也没人去质疑英语的重要性了。在这个问题上的一个主要论点是：我又不出国，不需要用到英语。很多家长、老师会想法设法的去反驳，却少有有说服力的理由。事实上，在我看来，这个论点的一部分是对的，如果你确信你不要英语的话，你确实不需要学它。在高考之前，学英语的主要理由是获得高分，而一旦高考结束，这个理由荡然无存，于是很多不想出国留学的大学生确实在突击应付四六级之外的时间里放弃了英语的学习，说明大多数人心里其实是认可这样的观点。但是为什么还多人，尤其是工作之后的人，往往回去后悔起当初没学好英语呢？我想，这是因为英语并不仅仅在出国之后才会用到。 本质上，英语作为语言的一种，是一种信息的载体。而现实情况下，它代表的是西方文化的全方位强势。试想，中国古代，没有人会去学英语。同样，建国后的中苏关系蜜月期，最为流行的语言是俄语，同样很少有人去学英语。英语崛起是伴随着20世纪末的经济全球化的兴起而来。如果提供一个简单的逻辑链条的话，学习的目的是找到既轻松又赚钱的工作，而这样的工作往往处于产业链的上游，在现在这样的时代，主要是一些具有高技术、全球化属性的金融、IT、高技术类工作，你无法指望流水线上的操作工既轻松有高薪。而这些工作所需要的高技术知识是从美国为代表的西方国家发端的，是以英语的形式传播的。相关的顶尖人才、学术泰斗也基本都是说英语的欧美人士。这就意味着，你在大部分行业往上走，总有一天会离不开英语。也许你会问，为什么我不能看一看那些翻译的书籍来学习知识呢？我想那是因为，知识是动态更新的，翻译总是滞后的。在这样一个日新月异的社会，市场竞争的残酷是无法容忍这样的滞后的。打个比方，如果你想学习如何生产制造计算机芯片，你可以去看翻译的国外教材，但是中文教材翻译的是十几年前的英文教材，而英文教材里写的设计方案又是二十年前的产品，在今天已经完全没有任何竞争力了。真正能够在生产中发挥价值的只有最新的技术文档、学术论文，而这样的资料是没有人会去专门翻译的。必须靠使用者自己去理解。 简单来说，在这样一个全球化的社会，竞争也是全球化的。只有掌握最先进的科学技术知识，才能够获得最先进的生产力，才具有和先发制人的欧美国家竞争的资本。而先进的科学技术知识是以英语为载体的，这就是我们学习英语的理由，也是国家重视英语教育的理由。在这个基础上，我觉得对于理工科学生来说，通过看英文小说或者美剧、英剧的方式学习英语不是一个有效的途径。因为无论消耗多少这样的“英语文化产品”，我们都不可能真正地学会那些“地道的表达”，达到和外国人“谈笑风生”的程度，而且这也偏离了我们本来的目的。我们大可直接去看有字幕或者翻译的版本。 这样的观点必然会有人喷我“功利”，我想强调的是这一观点适用于“不得不学”英语的人，对于以英语为爱好，或者本身喜欢接触不同文化的人不在讨论范围。这一观点的目的是端正英语学习的动机。英语并不是一个比其他学科高大上的学科，它是一个基础的工具，这一工具的主要价值是帮助我们在学习其他知识时到达更高的层次。端正动机能够把我们真正有效的英语学习过程筛选出来，把那些只是被动接触而非真正在学习的过程剔除出去，让我们能够更清醒的反思自己的英语学习。 学英语学的是什么学英语，人们提到最多的就是听、说、读、写四样。然而这只是最表面的东西，任何语言都有听说读写。人们还经常提到是“英语思维”，也就是要想英语为母语的人那样思考，只有那样我们才能真正学会英语。然而，我又要从“功利”的角度想一想了。我们应该把应试英语和实用英语区分开来。大多数人只有在应付各种英语考试的时候才会去认真的把“听、说、读、写”搬出来，针对性的突击一下。在日常生活中，每天都认真的兼顾“听、说、读、写”训练，而又不是为了考试的人恐怕凤毛麟角。我觉得这并不是因为大家自制力差、不够刻苦。为什么外国人把听说读写样样都用上呢？这是因为他们用得着。我们日常英语相关的任务往往只需要用到其中一两种，其它的一般都是中文为主。所以，对于中文环境中的英语学习者来说，要想“听、说、读、写”全面发展、齐头并进是几乎不可能的事，大部分中国人都是听、读能力强过说和写的能力。 我觉得“听、说、读、写”只是英语的表达形式，关注太多形式上的东西无益于实际水平的提升。我们真正应该关注的是内容。以内容或者说“主题（Topic）”来统筹英语学习的各个方面比用单一的形式学习松散的内容来得更为合理、有效。而主题的选择应该建立在兴趣或者需求的基础上。比如说，你看了一部好莱坞电影，发觉女主角人美演技佳，情不自禁地想去了解她，这时你可以去google她的资料，去Youtube上看她的访谈或者她参加的节目，向其他人推荐她。虽然你没接触过的英语还是不会，但是这次你并不在乎那个单词难不难学、有几个意思，你只在乎它表达了什么，对我了解这个人有什么帮助，在下次想起这个演员的时候，更容易联想起这个单词。这种内容驱动的学习方式更接近小孩子学习语言的过程，小孩子在学习语言的时候并不知道那个单词怎么拼写、有几种解释、例句是什么，他们只是把单词和对应的物体、情境、内容联系起来，在下次遇到类似的情况的时候回想起那个单词。当然，在面对复杂的内容的时候，学习过程不会这么简单，但是我觉得基本的理念应该保持不变，那就是：内容优先于形式。 学英语的“共识”虽然学习英语的方法五花八门，但是大家还是有一些“共识”的，比如下面这些漏屋发表在天涯上的网帖中所提起的： 要有语言环境, 多跟外国人交流，最好是能出国，不久自然就能会说了。 学习外语要多记多背，也就是说是用记忆学语言。 想纠正发音，一定要专听和模仿纯正的发音，比如BBC或VOA那种。 要学习外语语法，如果语法熟练，说句子就正确了。 要有词一定词汇量，要大量背单词。但背英语单词很难。 以前学的是书面语或过时的英语，和现在口语是不一样的，所以我口语不好。 学外语必须非常刻苦，长时间反复练习。 这些“共识”几乎没有人怀疑过，一届又一届的学生在这些“共识”的指导下投入到英语学习之中，却少有人去思考它们是否真的正确合理。这些“共识”有一些共同点：1. 崇尚正统英语，或是BBC之类的播音员式的发音，或者是单词书上的单词，或者是纯正的英语环境；2. 在对自制力或者刻苦程度的要求上走上两个极端。一方面强调学英语得持之以恒地背诵记忆大量的单词，一方面这种刻苦只要出了国，到了英语环境里又可以不需要了，这无疑是自相矛盾的。人不是机器，虽然是有人可以记下整本英语字典，英语发音可以像播音员一样标准，但是我们都知道自己不是那样的人。即使是看起来最理所当然的第一条，其实也未必完全正确。举个简单的例子，虽然现在大部分人的普通话都很标准，但是我们身边仍然有一些人说话会带有口音，那么为什么他们天天和我们在一起，发音却没能变得标准呢。可见，单纯的环境并不一定能使英语提高。更详细的阐释大家可以看前文提到的网帖。 这些“共识”其实是不折不扣的误区，他们把我们的努力引导向错误的方向。英语学不好被简单的归结为不够努力或者是没有学习环境。一定程度上，这些误区是被谋利的商人和懒惰的老师所利用，以至于过分深入人心，几乎成了真理。 英语学习的科学理论那么到底怎么学英语呢？我们不是第一个问这个问题的人，也不会是最后一个。我想，我们还是应该相信科学。英语作为语言的一种，其学习方法可以归类为更一般的“语言的学习”，属于语言学的范畴。语言学研究历史肯定十分悠久，各种理论五花八门，作为非专业人士，我们自然没有什么经历去认真研究学习。然而，严肃的科学研究的价值不应该被忽略。科学理论往往高屋建瓴、逻辑清晰，对于我们寻找更好的学习方法会有很大的帮助。 现在，关于英语学习的最为知名的理论之一，是Stephen Krashen博士的二语习得理论。简单来说，这一理论主要包含以下几个要点： The Acquisition-Learning Hypothesis（“悉得”-“学得”假设）“Acquisition”和“Learning”用来描述人类掌握语言的两种方式，翻译成汉语的话，可以对应的称为“悉得”和“学得”，“悉”是“熟悉”的“悉”，“学”是“学习”的“学”。这两种方式有什么区别呢？ “悉得”意味着语言能力是通过潜移默化的潜意识中的慢慢熟悉的过程获得的。 “学得”意味着语言能力是通过有意识的系统的学习过程掌握的。 这两种方式的划分更有利于我们对各种英语学习的过程进行区别。正如有的人经常觉得不满的现象：为什么他每天看看电视、聊聊天英语却比天天认真刻苦背单词的我好得多呢？这意味着“悉得”和“学得”这两种方式的适用情况和学习效率是有所区别的。 The Natural Order Hypothesis （自然顺序假设）自然顺序假说认为，人们对语言结构知识的习得是按自然顺序进行的。例如，一些实验表明，在儿童和成人将英语作为第二语言学习时，掌握进行时先于掌握过去时，掌握名词复数先于掌握名词所有格 ’ s 等。这并不是说我们要按某种顺序来说英语，因为我们无法搞清楚每个语法的先后顺序，实际上，这一假设提醒我们，英语的知识体系应该关注于自身的简洁和统一，而我们学习的时候会按照自身的接受习惯。死板的规定和计划只会捣乱自身的学习节奏，并不会让学习更有效。 The Monitor Hypothesis （监控假设）监控假设认为，口语交谈中话语是由“悉得”系统产生，再由“学得”系统检验，而后出口。也就是说，语法之类的书本知识在实际使用英语的过程中所扮演的角色是事后监督。你语法学得再好，在你实际交谈的时候也发挥不了作用，你仍然只能凭感觉去说，只是在说完以后，语法知识能够反馈出你所说句子是否正确。没有人能够在一边说话的时候一边思考语法细节。我个人认为，这一假设提醒我们，“学得”的知识不能代替“悉得”的知识，他们可以互相补充。英语的流利程度往往是由“悉得”的语言能力体现出来的。 The Input Hypothesis （输入假设）输入假设认为，只有对内容的意义而不是形式的专注理解才能够形成有效输入，从而“悉得”语言。同时，人们在某一学习阶段所能吸收的新的语言知识只能略高于当前知识水平，而不能超过太多。只有那些是凭借已经掌握的知识能够合理推断出来的新知识才是有效的，简而言之，就是英语学习需要循序渐进、日积月累。 The Affective Filter Hypothesis （有效过滤假设）有效过滤假设认为，情感、心理等因素影响着悉得语言的速度和质量。人们不应该忽略自身学习的动力、性格和情感因素，片面强调自制力、刻苦。事实上，心情愉悦而轻松的状态下所学习的语言知识更容易掌握。 The Output Hypothesis （输出假设）和输入假设类似，输出假设认为，只有在专注于内容的意义而不是形式的前提下，输出的略高于自身现有水平的知识才是有效的，才能够提升自己的英语能力。所谓专注于内容的意义而不是形式，意味着写作的时候关心的是表达怎样的观点而不是怎么写不会被扣分。所谓略高于自身现有水平的输出，意味着即使你天天背GRE单词，写的确实初中英语作文，那么写作水平永远也不会提高。同样，只背了四级单词，却要去写专业学术论文，英语也不能得到有效提高。 总结英语的学习应该分为两种方式：悉得和学得。前者强调潜移默化的积累，其成效直接决定了英语的流利程度；而后者强调系统的学习，它能够总结沉淀通过前者学到的知识，检验和指导前者的学习进程。 我们应该正视自身的情感、心理状态，尊重客观的学习规律，在循序渐进、日积月累基础上学习英语。我们更应该放弃以考试为中心，将更多的精力放在英语背后所承载的文化和科技内涵上。 英语学习资料推荐 《文法俱乐部》，旋元佑 《找对英语学习方法的第一本书》，陋屋 《把你的英语用起来》，伍君仪 / 刘晓光","categories":[],"tags":[{"name":"英语","slug":"英语","permalink":"https://jerrynju.github.io/tags/英语/"},{"name":"学习","slug":"学习","permalink":"https://jerrynju.github.io/tags/学习/"}]},{"title":"","slug":"短时间就能学会的受用终身的技能","date":"2018-01-13T08:27:04.736Z","updated":"2018-01-13T08:26:52.000Z","comments":true,"path":"2018/01/13/短时间就能学会的受用终身的技能/","link":"","permalink":"https://jerrynju.github.io/2018/01/13/短时间就能学会的受用终身的技能/","excerpt":"","text":"人们常说“鱼和熊掌不可兼得”，学习一项技能所花费的时间和它给你带来的价值往往成正比。但是也有一些被人忽略的小技能，掌握它并不需要耗费太多的精力，但是熟练使用以后却能够让工作效率得到很大提高。这样高性价比的技能可千万不要错过。 #用双拼输入法输入汉字 文字输入是人们日常生活和办公中必不可少的一个环节，消耗了人们的大量时间。然而，怎样才能获得最高的文字录入效率呢？曾经，很多人推荐五笔。但是五笔输入法有一些明显的弊端。一是学习门槛高，需要记忆大量的编码，时间一长也容易遗忘。另一个是在非单纯录入文字而是边想边输入的情况下，五笔需要输入者分心去回忆汉字编码，不仅打断了创作思路，输入速度也会大幅降低。与此同时，得益于现在互联网技术的发展，拼音输入法利用海量词库和在线联想，输入准确率得到了极大提高。可以说词库和联想功能的强大与否直接决定了一个输入法的好坏，人们再也没有足够的动力抛弃拼音输入法了。那么我们的输入速度能不能在拼音输入法的基础上进一步提高呢？ 答案当然是肯定的，而且这样的提高不需要付出太多的学习成本，基本可以做到一天上手，一周熟练掌握。提高的方法就是将大家普遍使用的全拼换成双拼。 通常一个汉字分为声母和韵母，全拼模式在输入时一般需要输入全部字母，或者输入词组的全部声母，而双拼输入法将两个以上字母组成的声母和韵母与单一键位对应，所有汉字无论原来拼音的长短，现在只需要输入两个字母即可，大大简化了按键次数，提升了效率。同时，输入字母的减少也让输错字母时的修改、定位变得更加方便。而且，由于每个汉字输入的字母数固定，不像全拼那样每个词组有不同的简化方式，双拼输入往往以词组为固定单位，每次输入差不多的字母即可按空格键将候选词上屏，有时能带来一种意想不到的节奏感。这种节奏感能进一步输入体验。 那么怎么使用双拼输入法呢？其实非常简单，不需要重新安装软件，因为绝大部分拼音输入法都自带双拼方案，只需要到设置菜单里选择就行了。现在的双拼方案有很多种，比如微软双拼、小鹤双拼、自然码等等。区别不大，选择一种熟练使用即可。笔者使用的是小鹤双拼方案。网上可以下载专门的双拼练习软件，基本一两个小时内就能熟悉大部分键位。一旦熟练以后，随着日常生活中的使用，会越来越熟练。 #手机上使用滑动输入法双拼输入法虽然好，但是在手机上使用却面临一些问题。虽然搜狗之类的常用手机输入法也可以选择双拼方案，但是只能在全键盘模式下使用，受限于手机屏幕的尺寸，全键盘模式下容易误按，因此并不推荐在手机上使用双拼输入法。 手机上的输入有一个更好的替代方案，那就是使用滑动输入法。滑动输入法让你在输入的时候手指无需离开屏幕，直接在本来要按的按键之间滑动，输入法会自动判断你要输入的字母。滑动输入法除了能够降低误触的概率，减少疲劳感之外，每一次滑动实际上起到了自动分词的作用，提高了输入效率。 #用正则表达式处理文本大家都用过Word等办公软件里的查找替换功能，可以方便的找出大量文字中的所需信息。但是这一功能非常简单，无法满足一些特殊需求。比如，如果你需要找出文本中的所有电话号码，怎么办呢？这个正则表达式就能派上用场了。 正则表达式的功能非常强大，但是语法也很令人头疼。如果你不是专业人士，只是用它来简化文字处理工作，可以尝试用一些现成的正则表达式处理软件。 正则表达式测试器RegexBuddy 还有一些简单明了的教程可以帮助你入门： 正则表达式（RegEx）——快速参考正则表达式30分钟入门教程 #用Markdown快速写作Markdown是一个简洁的文本标记语言，用于对文本快速进行格式化。 在这里你可以看到它的使用说明，非常简单，几分钟内就可以掌握它的基本语法。 我们为什么要学习使用Markdown呢？主要目的是让我们在电脑或网络上书写文字的时候能够专注于文字内容本身，而不是被各种格式甚至所羁绊。Markdown可以通过在文本内容中输入一些简单的字符生成格式化的文本，形成各级标题、有序无序列表、粗体、斜体、下划线等等。不需要将键盘上敲字敲得正起劲的手挪到鼠标上，点击各种图标来设置格式。现在有很多软件和网站都已经支持Markdown语法。比如为知笔记、简书，甚至可以通过在Chrome上安装Markdown Here插件，在网页文本框中直接将Markdown转化为html格式化语言。 笔者最近发现了一个小众而强大的Markdown编辑器“小书匠”，不仅支持增强的Markdown语言，还可以直接与各个笔记平台同步。界面美观，甚至提供了沉浸式的写作模式，令人爱不释手。希望大家去尝试一下。 #用远程桌面异地办公我们经常会遇到这样的情况，在办公室处理了一大堆数据文件，然而天色已晚，想回宿舍继续搞，但是桌面上打开的这一堆程序怎么办？一个个保存到U盘太费时费力，只好放弃做一次学霸的机会，明天再战。又或者在图书馆，身边只有笔记本，但是自己的笔记本很渣，不如办公室那装满了各种软件的台式机给力，怎么才能让远在办公室的台式机发挥作用呢？这些情况下你就需要远程桌面软件来助你一臂之力了。 远程桌面的作用就是将一台电脑的屏幕画面通过网络传输到远处的另一台电脑上，在远处电脑上的所有键盘输入和鼠标移动等操作也可以传输到那台电脑。这样我们就可以远程利用一台电脑的全部机能和软件。 远程桌面客户端有很多，Radmin是Windows上比较好的选择。Anydesk则是一个比较轻量化的选择。 #用批处理来简化系统操作如果你的工作经常需要用到一些软件，一一打开非常麻烦，又不想让它们同时开机启动，拖慢开机速度，可以写一个批处理脚本，双击之后就可以同时打开数个软件。比如，笔者常用的这个脚本，可以同时打开QQ、微信、为知笔记等等，如果你想要打开其他软件，只需要把路径替换掉即可。 start “” “D:\\SSVIP\\ShadowsocksR-3.7.4.1最新版.exe” &amp;start “” “C:\\Program Files (x86)\\Tencent\\QQLite\\Bin\\QQ.exe” &amp;start “” “D:\\Program Files\\Foxmail 7.2\\Foxmail.exe”&amp;start “” “C:\\Program Files (x86)\\Tencent\\WeChat\\WeChat.exe”&amp;start “” “C:\\Program Files\\Listary\\Listary.exe”&amp;start “” “C:\\Program Files (x86)\\WizNote\\Wiz.exe”&amp;start “” “C:\\Users\\Jerry\\AppData\\Local\\Wunderlist\\Wunderlist.exe”&amp; 拓展阅读 相关文章推荐 高效率科研神器——Build your organizing creativity 高效率科研神器——小软件、大能量 高效率科研神器——驾驭文献洪流 世上最强大的科研工具手册","categories":[],"tags":[]},{"title":"","slug":"人工智能时代的科学研究","date":"2018-01-13T08:27:04.719Z","updated":"2018-01-13T08:26:52.000Z","comments":true,"path":"2018/01/13/人工智能时代的科学研究/","link":"","permalink":"https://jerrynju.github.io/2018/01/13/人工智能时代的科学研究/","excerpt":"","text":"最近几年，以深度学习为代表的人工智能技术迎来了一次革命。目前，人工智能最为热门的方向在图像识别、自动驾驶、语音识别等领域。和这些领域层出不穷的明星初创公司相比，人工智能技术在科研领域的应用则相对少有人关注。然而，在这一领域，其实是有不少非常有趣的研究成果，本文将尝试进行一些总结。 科研领域人工智能技术的应用前景科研可以说是人类探索未知的最前沿战场，然而，和很多人所想象的不同的是，科研领域的生产力发展水平其实是相当低的。这一方面是由于科研领域众多，研究方向分散，没法规模化；另一方面是作为科研主体的研究生们价格十分低廉，采用手工作坊模式比较具有性价比。 但是科研发展到今天，寻找更有效率的工具既是美好的期望也是刻不容缓的现实需求。这是因为在大家的不懈灌水之下，现在科研论文的产出速度已经非常快了。即使是一个非常小众的领域，一个人阅读文献的速度也很难跟上新文献的产出速度。当然，我们可以通过个人经验筛选出其中有价值的那些，但是这就像手工作坊依赖老师傅一样，这样抽象的经验是否合理，能否传承是一个大问题。 那么，科学研究的哪些流程可以做的更好一点呢？这里我们可以列举一些： 检索。我们通常的搜索方式是在各个搜索引擎的搜索框里输出文字，获得返回的网页、图片等信息。但是对于科研来说，除了文字之外，我们还希望能够检索公式、专有名词、图片等等。这些检索内容在通常的搜索引擎中很难获得有效的结果。 引文网络。对于一篇文献来说，它引用的文献和引用它的文献都是很重要的参考信息。虽然很多出版商的网站提供了获取文献引文的选项，但是文献通常是以PDF的形式传播，我们希望能直接从离线存储的PDF文件中还原出它的引文信息。此外，如果能够从一片文献出发，描绘出相关的引文网络，我们就能够找到该领域的重要文献，非常有利于我们快速的掌握一个领域的核心信息。 知识记录。一篇文献的细节往往是非常之多的，一般情况下，我们只能通过在PDF文件或者引文管理软件中标注来记录重要的信息，可是，这样的记录方式显然是不够有效的，不仅很难讲零散记录的信息集中整理，时间一长也很容易遗忘当初标记的初衷。 问题的根源为什们会有这些问题呢？究其根本，这是因为现在的科研出版体系还停留在纸质时代，然而我们的工作方式早已迈入了互联网时代。令人悲观的是，这些问题虽然引起了一些人的关注，但是可能很难在短期内解决。因为工作效率的低下耗费的只是研究生们的青春，而这个行业并不缺源源不断涌入的勤劳的学生。而且，科研是一个垄断行业，几大国际出版商把持了绝对的话语权，如果他们没有变革的动力，行业本身并不会发生根本的变化。 但是对于学生们来说，时间是宝贵的财富。工作效率是赢得时间的根本手段，因此我们非常有必要关注一些能提高效率的工具。这里，我将列举一些最新的工具，他们也许能在你的日常工作中派上用场。需要注意的是，这里的很多工具具有实验性质，他们的功能可能还相当不完善，因此需要你自己使用之后来判断它的价值。 科研工具的搜索引擎——LabWormLabWorm是一个用来搜索科研工具的搜索引擎，这里有着各种五花八门的科研相关工具。 检索工具更具深度的文献搜索引擎AMiner是由清华大学的团队开发的文献检索引擎，相比传统的文献检索引擎，它提供了更多更具深度的内容，比如，按照h-index排序检索结果，给出作者的常见合作者，文章或者领域的历年引用趋势等等，同时它还提供一定的社交功能，可以对作者投票或者评论。可以说AMiner代表了文献搜索引擎的未来。但是它主要侧重计算机领域的文献，其它领域的文献信息不是非常完善。 用公式来搜索维基百科Koala能够让你通过输入Latex表达式形式的公式来检索维基百科，它会自动分析相近形式的公式，给出相关维基百科条目的链接。 用公式来搜索网页uniquation，如果你希望用公式来搜索所有网页结果，可以试试这个，同样需要以Latex形式输入公式，也会给出相近形式的公式。如果你对Latex表达式的写法不熟悉，可以搜索一些在线的Latex公式转换器。 用图片来搜索论文Viziometrics是一个完全基于图片的搜索引擎。其实论实用性，它估计比不上谷歌图片搜索。它是直接提取论文中的图片和图片标题来生成相关搜索项，是一个非常有意思的工具，虽然打开速度很慢。 引文相关工具自动提取PDF中的文献信息cermine是一个开源项目，它提供一个在线工具，能够将你上传的PDF格式的文献中的关键信息提取出来，这些信息包括作者、单位、摘要、参考文献等等。 引用文献的逆向格式化CitationFinder是一个相当神奇的实用工具。我们知道，文献管理软件可以将数据库导出成各种专有格式，这些格式可以转换成txt。可是，反过来把TXT还原成文献管理软件能够识别的格式却是一个难题。这个网站可以将大段TXT格式的参考文献列表转换成常用的文献管理软件能够识别的格式，正确率相当高。 公式自动识别InftyReader是一个OCR软件，它的强大之处在于它能够将pdf文件中的公式转换成Word或者Latex格式，准确率是目前最高的。 引文网络分析理论上来说，引文网络分析是科学研究中的重要内容，但是实际上却很少有人去做这样的事情。原因是多方面的，一是：引文网络本身涉及的方面非常多，比如作者之间的引用关系，期刊权重的排序等等；二是，一旦涉及到较深的层次，引文的数量将会非常庞大，导致获取、分析和展示文献信息都将变得非常缓慢；三是，如何将复杂的网络清晰的展现出来，并从中发掘有用的信息也是一个难题。所以，虽然现在已经有一些工具能够实现引文网络的分析，但是学习成本相当高，普及率很低。目前，常用的引文分析软件包括：CiteSpace、SCI2和HistCite，有兴趣的人自行尝试。需要注意的是，官方的HistCite版本有一些Bug，如果需要可以用这里的版本。 科研知识管理用思维导图管理文献如果将数量繁多的文献中有用的信息组织起来是一个难题，将文献以思维导图的形式组织起来是一个可供尝试的方向。Docear就是为这一目的而生的软件。它的功能比较完善，但是使用起来有些复杂。 与PDF阅读器集成的文献管理软件与思维导图这一本身并不太普及的形式相比，直接在PDF文件上标注信息则实用的多，然而，如何将标注的信息组织起来呢？Mac和iOS上有一款国人开发的软件MarginNote就是为这一目的量身打造，它不仅可以将PDF文件中的信息用思维导图组织起来，还可以生成记忆卡片，用作背诵之用，因而广受医学、法律专业的学生欢迎。遗憾的是，这一软件并没有Windows版本。 Windows用户可以使用文献管理软件Citavi，在提供常用的文献管理，Word引文插入功能之外，它还提供了一个Adobe PDF 阅读器的插件，可以直接在PDF文件上标注，这些标注的信息可以单独组织管理，也可以导出到思维导图软件。这个软件的另外一个亮点是，在Word中不仅可以插入文献库中的文献，也可以检索插入标注的文献中的信息。 除了文献管理软件之外，还有一类更专业的文件标注工具，学名叫质性分析软件，在心理学、社会学等学科比较常用。这类软件能够标注的文件类型更为广泛，以常用的atlas.ti软件为类，它除了可以标记PDF、Word之外，还可以标记音频、视频，标注的信息以节点方式组织，可以注释、组合、链接。这类软件适合分析含有大量文本、音视频数据，需要提取抽象信息的项目。 幻想未来科学研究有着理论上的巨大价值，但是对于身在其中的从业者，个中甘苦，唯有己知。本文介绍了很多具有实验性质的工具，它们中到底哪些能够真的普及，尚未可知。趁着人工智能的东风，不妨让我们畅想一下科学研究的未来，想象一下，人工智能在科学研究中有哪些应用前景。 自动提取PDF格式文献的核心信息，识别其中的各个区域，生成结构化文件。这涉及到版面识别，文本OCR等方面。现在已经有一些相对成熟的工作。 内容感知检索。将PDF文件中的公式、专有名字、图片加入针对性的检索选项，可以一键搜索相关内容。 学术专用的网络爬虫。针对作者、单位，通过网络爬虫搜索到课题组主页、作者职称、单位排名等信息。 试剂、仪器识别。针对文献中提到的试剂、仪器信息，自动给出相应的购买链接和参考价格。 合作式的标注和社交化评论。不同地点的作者可以共同标记同一篇文献，并且可以相互查阅。同时可以建立一个问答平台，作者和读者可以直接交流。读者可以点赞，也可以质疑。 引文网络生成和文献推荐。自动生成文献的引用和被引网络，同时根据文献的关键词和相关文献，自动推荐相关论文。 知识链接。对于文献中提到的知识，可以自动链接教科书中对应的内容。 语义分析。自动分析文献中语句含义，归纳提取关键信息，生成逻辑关系图。 语言翻译。将英文自动翻译成其他语言。 链接企业。根据文献信息，链接到关注或者从事相关技术的公司。 团队管理和流程控制。 引入企业中的团队管理体系和流程化工作方式，便于课题组绩效考核和效率控制。。。。。可以想象的地方还有很多，但是要想完全实现上面的设想，恐怕需要一个堪比BAT规模的企业。但是再完善的工具也只是工具，最核心的仍然是人类自身的创造力。","categories":[],"tags":[]},{"title":"","slug":"SSH入门及基础命令大全","date":"2018-01-13T08:27:04.713Z","updated":"2018-01-13T08:26:52.000Z","comments":true,"path":"2018/01/13/SSH入门及基础命令大全/","link":"","permalink":"https://jerrynju.github.io/2018/01/13/SSH入门及基础命令大全/","excerpt":"","text":"SSH简介在Linux系统中，OpenSSH是目前最流行的远程系统登录与文件传输应用，也是传统Telenet、FTP和R系列等网络应用的换代产品。其 中，ssh（Secure Shell）可以替代telnet、rlogin和rsh，scp（Secure Copy）与sftp（Secure FTP）能后替代ftp。 Ubuntu下安装OpenSHH在Ubuntu中，OpenSSH的客户端作为一个基础系统软件会随这系统一起安装，但OpenSSH服务器需要单独安装。安装openssh-server服务器软件包，可以使用apt-get、aptitude或synaptic等软件工具。$ sudo apt-get install openssh-server安装之后，可以使用以下命令验证OpenSSH服务器的sshd守护进程是否已开启。$ pidof sshd 使用SSH登录到远程系统在OpenSSH中，ssh是一个重要的客户端应用程序。利用ssh，可以采用加密的通信方式，登录到远程系统，其语法格式如下:ssh [options] [-l login_name][user@]hostname [command]其中，”-llogin_name”选项用于指定用户名，表示以哪一个用户身份登录到远程系统。如果不提供用户名，则以当前用户的身份登录到远程系 统。例如，下面命令形式表示以webgod用户身份，采用默认的22端口，登录到远程系统。除了”-l”选项之外，为了以其他用户身份登录到远程系统，还可 以使用”user@hostname”的方式登录到远程系统。 第一次使用ssh登录到远程系统时，ssh将会给出一个警告信息，提示用户确认连接的远程系统是否正确。如果用户确认yes，ssh将会在用户主目 录的~/.ssh/known_hosts文件中存储远程系统的密钥，同时也会把客户端用户的密钥发送到远程系统。当用户再次登录到同一远程系统时，就不 会再出现提示信息了。 使用ssh执行远程系统命令具体用法，在ssh命令后增加一条命令，命令前后使用双引号括起来。$ ssh webgod@10.203.138.129 “uname -r”这种一次性登录，执行远程命令，然后立即返回的功能是非常有用的。 使用SCP替代FTP从网络通信角度来看，FTP的数据传输方式是不安全的，因为FTP协议在网络中传输的用户名、密码和数据没有采取任何加密措施。比较安全的方法是采用OpenSSH的SFTP和SCP。 scp是OpenSSH中的另一个重要客户端软件。scp命令的格式如下：scp [[user@host1:]file1[[user@]host2:]file2第一个参数是源文件，第二个参数是目的文件。当需要复制远程系统中的文件时，SCP首先需要成功登录到远程系统中，然后才能开始传输文件，因此要求提供远程系统的名字、用户名和密码。 利用scp下载文件例如，要把远程系统中的~/.ssh/id_rsa.pub文件复制到本地系统的/tmp目录中。$ scp webgod@10.203.138.129:~/.ssh/id_rsa.pub /tmp假定已经把sshd守护进程监听的TCP端口修改为435。要使用该端口进行文件复制，则可以用如下命令。$ scp -P 534 webgod@10.203.138.129:~/.ssh/id_rsa.pub /tmp 利用scp上传文件$ scp /etc/hosts webgod@10.203.138.129:/tmp$ scp -P 435 /etc/hosts webgod@10.203.138.129: /tmp 常用代码1. 基础命令A.显示文件源代码cat ooxx.php没错, cat 是一个常用查看源代码的命令,优点是很方便很可爱,缺点是会直接刷刷刷显示所有源代码,文件太长只能看到屁股后面的那坨代码 B. 查看当前目录pwdpwd不是password,而是查看当前目录,会输出完整的路径 C. 更改目录 Change Directory (cd)cd /path/to/directory/有DOS基础的同学应该会淫荡的一笑吧,路径可以用相对也可以用绝对 D. 列出文件/子目录 Listing Files/SubFolders(ls)ls默认只显示文件名,你也可以带个参数玩,比如ls -alh带 -alh 输出会很爽… 自己试试, 大猫喜欢把 ls -alh 颜射为 ll-a显示全部文件-l比较详细的列表-h人类能看懂的比如把1024显示为1K E.帮助命令 --help任何命令后面带一个 –help 都会显示一个简洁版的帮助,记不住参数就查一下 F.获取远程文件 wgetwget http://ooxx.me/me.jpg就会获取远程的me.jpg文件到当前目录,一般搬家的时候用这个让服务器去获取另一个服务器的数据,速度会快的完全不像男人 G.压缩解压缩unzip wordpress.zip如果文件是zip形式的,比如刚从wordpress主站wget了一个压缩包过来,只需要输入unzip 文件名,就可以解压缩到当前目录了tar -czvf ooxx.tar.gz *把当前目录所有文件以tar命令打包为ooxx.tar.gz文件-c创建-z用gzip压缩方式-v显示压缩过程-f搞成一坨filetar -xzvf ooxx.tar.gz解压缩 ooxx.tar.gz 里的文件到当前目录-x解压缩-z用gzip压缩方式-v显示压缩过程-f搞成一坨file 2. 文件系统命令A.显示磁盘使用率df显示整个主机的总容量以及比率 B.列表文件/子目录使用率 (du)du会列出所有文件以及子目录的大小,不是人看的…du -sh-s就是summary,只输出当前文件夹总容量-h一般在linux就是human给人看的意思,会把1048580b转换为1mb显示du -h --max-depth=1嘿,只列出当前文件夹和第一级子目录占用大小 C.删除文件 Remove files (rm) 少儿不宜的命令,总是需要确认rm -vf miao.in强制删除miao.in这个文件并不需确认,列出删除文件列表 强制删除,不要执行,除非你知道你在干嘛…-v一般v参数都是显示过程的意思-f 强奸的单词会不会拼? F-U-C-K的缩写,不确认直接F-word了rm -rf ooxx删除ooxx这个文件夹,包含它的子文件和子文件夹 删除文件用上面的命令,但删除文件夹的时候就需要跑下遍历了-r 比较本土化,是”日”的缩写,在所有命令里都是 recursive 的意思,有些命令是大写的 R 需要注意 D. 拷贝文件 (cp)cp ooxx.me miao.in复制ooxx.me这个文件并重命名为miao.in E. 移动文件/重命名 (mv)mv ooxx.me miao.in重命名ooxx.me为miao.in如果加路径,就是移动到某个路径并重命名为miao.in和DOS不一样,移动文件和重命名换个思路,其实是一个套路,不是么? F. 创建空文件 (touch)touch miao.in这个很色情的命令,就是创建一个 miao.in 的空文件如果touch了已有的文件,则会更新那个文件的日期为当前如果touch次数多了,会high 3. 文件权限A. 更改文件权限 (chmod)chmod 777 miao.in默认文件为644,文件夹为755 TIP:1st digit=Owner; 2nd=Group; 3rd=Other(-rwxrwxwrx = 777, -rwxr-xr-x = 755, -rw-r–r– = 644, etc.)7 = Read + Write + Execute6 = Read + Write5 = Read + Execute4 = Read3 = Write + Execute2 = Write1 = Execute0 = All access denied 4. 高级命令A. 查找. 常用命令,让我们来找一下10MB以上的文件吧find . -type f -size +10000k -exec ls -lh {} \\; | awk &#39;{ print $5 &quot;: &quot; $9 }&#39; |sort -n B. Grep, 手里握着大西瓜 ls -alh | grep ooxx只显示含有ooxx的那几列,当然你在cat的时候配合这个用找文件里的某些字段很方便 C. 分页 (Less/More)less miao.php如果源代码很长,则会分页显示,上下箭头滚动,输入q退出tail -n 1000 /var/log/httpd/error_log | more可以用 | more 参数来滚动显示页面或行 5. MYSQL 数据库导出数据库mysqldump -u 数据库用户名 -p 数据库名 &gt; db_ooxx.sql导出数据库为db_ooxx.sql 导入数据库mysql -u 数据库用户名 -p 数据库名 &lt; db_ooxx.sql --default-character-set=utf8把当前目录的 db_ooxx.sql 以 utf8 编码导入,当然你原来是gbk就改成gbk","categories":[],"tags":[]},{"title":"","slug":"一种无须编程的数据搜集、分析流程","date":"2018-01-13T08:27:04.700Z","updated":"2018-01-13T08:26:52.000Z","comments":true,"path":"2018/01/13/一种无须编程的数据搜集、分析流程/","link":"","permalink":"https://jerrynju.github.io/2018/01/13/一种无须编程的数据搜集、分析流程/","excerpt":"","text":"一种无须编程的数据搜集、分析流程前言这是一个信息爆炸的时代，信息产生的速度已经远远找过了我们阅读和理解信息的速度。但是，现在层出不穷的海量信息中真正有用的却是少数，如果全部依赖人工来查找、搜集和分析这些海量的信息，效率将会非常低下。虽然大数据技术已经火爆了几年了，但是如何将这些技术真正应用到日常工作中仍然是一个难题，因为并不是所有人都会编程，都有经历去针对一些简单的需求搭建复杂的工具。所以这里我尝试探讨一种无须编程的工作方式来实现信息的高效率搜集和处理。目标是用最简单的工具来满足最现实需求。 工具这个工作流程主要由两部分组成，一是通过网络爬虫软件批量搜集信息，这一部分主要是通过八爪鱼搜集器来实现；另一部分是数据的处理、分析和展示，这一部分主要是通过KNIME分析软件来实现。这两个软件是笔者经过很多尝试以后的选择，下面笔者简单解释一下为什么选择这两个软件。 八爪鱼搜集器是一个国产的商业爬虫工具。爬虫工具有很多，开源和免费的也不少，为什么选择这一款商业软件呢？主要是基于以下考虑：一是这个软件操作足够简单、功能足够强大。爬虫看起来是一个简单的需求，但是其中的坑非常多，对于非程序员来说，想要快速实现自己的需求还是需要依赖一些成熟的工具。这一点上，这个软件能够满足需求，它既提供功能强大的自定义模式，也提供傻瓜化的自动模式。二是，虽然它是商业软件，但是对于一般用户来说，使用免费单机版就够了，初始积分足够采集数万条数据。当然如果你有其他的比较熟悉的工具也完全可以替代这个软件。 KNIME是一个较为知名的开源数据分析平台，Java语言编写，基于Eclipse平台构建。它是一个相对比较完善的大数据分析平台，提供了丰富的扩展。它的主要优点有下面几点：一是开源、免费。二是图形化操作方式，只需要通过拖动各个模块，然后连接起来就可以实现各种分析功能。三是KNIME中的工作流程可以分部执行，便于初学者及时发现错误。四是强大的扩展能力，我们可以在工作流中插入R、Python、Java和JavaScript代码片段，实现各种强大功能。在我们这个工作流中，KNIME是后期处理的核心。当然，它还是有一定的学习难度的，它的所有界面、文档都是英文的，工具也非常多，熟悉起来需要花费一定的时间。 任务我尝试通过两个例子来说明这一流程的工作方式。 第一个例子是在科学网上自动查找各高校和科研机构的招聘信息，提取出其中的关键内容，并且将招聘信息按照地理位置进行分类，便于找工作的时候根据自己的偏好浏览最值得关注的信息。科学网上常年有很多的招聘信息，但是这些信息往往篇幅很长，我们在浏览这些信息之前往往有一些自己的求职意向，比如希望招聘单位限定在某个地区，或者单位待遇如何。对大量此类信息的自动处理能够让我们将主要精力集中在符合我们需求的信息上，大大节省我们的时间。同样，篇幅所限，这里我们展示的具体任务过程是，从科学网上获取100条招聘信息，提取出招聘信息中的招聘单位名称，通过调用百度地图的API自动获得这些招聘单位的地址，并且在地图上展示出来。 第二个例子是在Web of Science网站上搜索特定关键词相关的文献，自动获取文献的相关信息，然后分析文献摘要中的关键信息和文献所在期刊的影响因子。这个例子对应的是研究生日常工作中非常常见的一个任务：文献的调研。Web of Science作为查找文献最权威的收费数据库，是我们日常获取文献信息的主要来源，如果能够实现其中信息的自动获取分析，能够大大提高我们平时的工作效率。篇幅所限，本文将展示如何完成下面这个具体的任务：从Web of Science上获取20篇关于“Graphene”的文献信息，分析每篇文献中通信作者的单位地址，并将其在地图中展示出来。 案例一，招聘信息的自动获取和分析1. 第一部分，从网上下载信息 打开八爪鱼采集器，选择自定义采集。因为科学网的网页结构较为简单，也可以使用向导模式。 输入我们要采集的网址：http://talent.sciencenet.cn/index.php?s=List/index/pid/G。点击页面中的招聘条目，根据右侧的操作提示，点选同类型的链接。 添加一个循环点击每个链接的动作，然后打开一条链接，选择页面中的对应元素，做好标注。如果想采集所有页面上的信息，可以添加翻页动作。 定义好规则以后我们保存任务，然后选择单机运行。 软件会如果定义的规则没有问题，软件将自动采集这个版块的所有照片信息。 这里我们采集了这个页面中的100条信息作为示例，每条信息分别包括标题、内容和发布时间、地点。 导出我们的数据至Excel文件。这样我们就完成了工作流程的第一部分，获得了100条招聘信息。只要我们主要软件的使用提示，一般能够很快上手。 2. 第二部分，清理与展示信息 打开KNIME软件。KNIME软件是在Eclipse的基础上编写的，原始界面有很多子窗口，我们可以把暂时用不到的窗口关掉或者最小化，只保留最重要的工作区，节点库窗口和节点说明窗口。 KNIME的工作方式是从左侧节点库中拖动节点至中间工作区，当我们点击节点的时候，右侧的节点说明窗口会显示当前节点的主要信息。一个节点图标主要由三部分组成，上方是该节点的功能说明，中间是节点图标，图标下方三个点像红绿灯一样，如果红点亮，表明该节点配置不正确或者运行错误，黄灯亮表示还未设置或者运行过，绿灯亮表明运行正常。在设置某些节点的时候，我们需要实现将它的输入端连接起来，否则无法进行配置。详细的说明可以参考软件的帮助文档。 这里我们首先新建一个空白Workflow文件，从节点库中依次选择“IO-Read-Excel Reader”节点，将其拖动到工作区。 双击该节点图标，会出现配置窗口。如果我们初次看到这个窗口，可能会被复杂的设置选项吓到，其实这些选择并不复杂。我们只需要关心第一个Tab“XLS Reader Settings”就行了。配置完成后我们可以点击工具栏上的运行按钮先运行该节点，在节点图标上右键可以在菜单中找到查看输出结果的选项。这种分布执行，每一步都可以查看结果的操作方式有利于初学者及时发现问题所在。 在导入了数据之后就是对数据的处理了，对于我们获得招聘单位地理位置分布这个目标来说，我们这里清洗数据的目的是获得标题中的招聘单位。我们可以先使用Column Filter过滤出我们需要的列，然后使用Regex Split正则表达式工具提取出其中的单位名称。正则表达式的使用是一个较为复杂的部分，读者可能需要自行查阅资料了解。需要注意的是，KNIME使用的是Java的正则表达式语法，在这个节点中，我们将单元格中的内容用几个括号包裹的正则表达式表示出来，而每个括号中匹配到的内容会作为单独的列提取出来。我们通过“大学、学院、所”等名称来匹配单位名。 由于部分招聘信息的单位比较特殊，匹配不到，所以节点中会出现一个黄色感叹号，这部分数据我们也可以通过右键菜单查看到，这里我们主要关注能够匹配到的数据。通过添加一个Row Filter行过滤节点来去掉没有匹配到的数据。 如果获得单位所在地理坐标呢？如果是英文地址的话，有现成的节点可以使用（详见案例二）。中文地址的话我们需要调用百度地图的Web API来进行地理编码Geocoding。这一部分主要通过Get Request节点实现。使用之前我们需要生成一个带有查询URL地址的列来供这个节点调用。这一部分的具体信息我们需要查阅百度地图API的使用文档。简单来说，就是注册账号，然后先获取一个Key，然后将单位名称加到带有Key的查询地址中。这一步操作我们需要用到String Manipulation节点，在该节点中通过Join函数将对应的列数据加到基本查询地址中。 执行查询后，我们先用Binary Objects to Strings节点将返回的信息编程字符串，然后通过Regex Split正则表达式工具将其中的经纬度提取出来，然后用String to Number节点转换为数字格式，这样我们就获得了每条招聘信息所对应的招聘单位地理坐标。当然，由于同一个单位可以由不同的分部，仅从标题获取的地址未必准确。 下面我们要做的就是把这些地理坐标在地图上标注出来了。在这之前我们需要安装Palladian节点工具包，安装方法很简单，依次打开“File”-“Install Knime Extensions”，然后在搜索框里输入Palladian，打个勾，点下一步，同意一下协议，就能自动下载安装了。 安装好以后，我们先使用该工具包中的LatitudeLongitudeToCoordinate节点将经纬度坐标组合起来，然后再与MapView节点连接就可以了，运行之后我们就能看到这些单位的地理分布了，放大地图还可以进一步查看细节。 案例二，文献信息的自动获取和分析1. 第一部分，获取信息获取信息的部分和案例一中的过程很类似，这里不再赘述，读者稍加尝试应该都可以完成。这里我以“Graphene”为关键词，并且按照被引频次从高到低排序，在“Web of Science”上爬取了20条文献信息作为示例。 2.第二部分，清理和展示信息数据在Knime中的导入和提取与案例一类似，需要注意的是，笔者提取出的文献通信作者单位信息有好几行，只有第一行是我们需要的详细地址。这里我们可以使用Cell Splitter工具，以换行符作为区分，将每一个单元格分解到三列中去，在过滤出第一列。为了获得这些英文地址对应的GPS坐标，我们可以使用案例一中下载的Palladian工具包中的MapzenGeocoder节点，需要注意的是，在使用之前我们需要打开“FIle”-“Preferences”-“Palladian Geocoder”，从网上注册账号获取Mapzen的API Key，然后填写进去。MapzenGeocoder可以直接和Mapview连接，就可以将地理坐标在地图中展示出来了。 总结八爪鱼的优点在于简单易用，而Knime在于开源强大。Knime的功能远不止上面讨论的这些，需要读者自己去探索。总的来说，这样一条工具链具有很大的想象空间，而这一空间主要体现在Knime中。Knime中提供的API查询工具，让我们可以使用网络上丰富的API工具，比如翻译、自然语言处理等等，将State of the Art的Machine Learning结合进来。事实上，Knime中已经有了专门的化学分子查询和药物筛选的工具包，只是对于大多人来说，没有这样的需求罢了。 和传统的编程实现方式相比，这样一种操作方式最大的优点到还不在它的简便与否，而在于它的模块化。我们在使用Knime的时候自然会将任务进行分解，让我们自己理清楚我们需要做哪些事情，而每个节点的独立设置、执行和结果查询，让我们可以以步步为营的方式不断推进我们的工作。一旦我们实现了一个可行的工作流，就可以将它重复利用，在其中修修补补调整功能也变得很容易。 当然，缺点也是不可避免的，中文学习资源的匮乏需要我们有一颗不断折腾的心。即使其功能再强大，如果我们并没有什么改变现行工作方式的迫切冲动，那也是无济于事的。不过，如果你都看到了这里，我想你应该有这种冲动。","categories":[],"tags":[]},{"title":"","slug":"高效率科研神器——小软件、大能量","date":"2018-01-13T08:27:04.693Z","updated":"2018-01-13T08:26:52.000Z","comments":true,"path":"2018/01/13/高效率科研神器——小软件、大能量/","link":"","permalink":"https://jerrynju.github.io/2018/01/13/高效率科研神器——小软件、大能量/","excerpt":"","text":"时间就是金钱，效率就是生命 上一期我介绍了两个“大”软件——“Directory Opus”和“Firefox阳光盒子定制版”。这两个软件能够很好的替代日常使用中最常见的文件管理器和网页浏览器。这一期，我要介绍一些真正的小众软件。这些软件身边知道的人很少，使用者更少，但是它们很好的解决了一到两个“痛点”，用的好的话能够极大提升工作效率。 #全能入口——Wox、Listary、Rolan 软件获取地址：Wox；Listary；Rolan 各位如果要打开一个程序或者查找一个文件会从哪里开始呢？xp和win7时代，第一个想到的是开始菜单或者桌面快捷方式。到了Win10，还有一个Cortana可以助我们一臂之力。这些方法虽没有什么大问题，然而远远称不上完美。开始菜单需要我们多次点击，太多的快捷方式会让电脑桌面显得凌乱不堪，而Cortana反应略微迟钝，显示的信息也不够精炼。事实上，我们大多数时候并没有意识到我们需要一个比开始菜单更方便高效的替代品。这里我想介绍的两个软件可以成为这样的替代品，根据我自己的使用体验，一旦你习惯了它们，你会忘记开始菜单的存在。 ##Wox-Win平台的AlfredMac平台的Alfred是一个广受好评的神器，它带来了工作效率的大幅提升。但是Win平台一直缺乏类似的工具，而Wox是一个中国程序员的作品，它诞生的目的就是成为Windows平台的Alfred。作为免费开源软件，目前在功能性上尚不能和收费的Alfred比拼，但是它已经能够实现很多强大功能，那么我们就来看看它到底是一个什么样的软件。 下面关于Wox的介绍引用自异次元软件 你可以将 Wox 看作一个高效的本地快速搜索框，通过快捷键呼出，然后输入关键字来搜索程序进行快速启动，或者搜索本地硬盘的文件，打开百度、Google 进行搜索，甚至是通过一些插件的功能实现单词翻译、关闭屏幕、查询剪贴板历史、查询编程文档、查询天气等更多功能。 ###支持中文相比 Launchy 等同类的快速启动器工具，Wox 最大的特点是可以支持中文拼音的模糊匹配。譬如说你想搜索“设备管理器”，那么只需输入”sheb”就能匹配得到。 ###便捷搜索Wox的网页搜索功能是可以让用户自己为某个搜索引擎设置一个关键字。举个简单例子，如果用户经常使用百度搜索。那么用户就可以在 Wox的设置里的 Web Search 选项中，点击 Add 增加这么一个选项（URL为 http://www.baidu.com/s?wd={q}）： 这样，你便可以通过在Wox搜索框里输入「bd 关键字」进行百度搜索。同理，你也可以增一个淘宝搜索、必应搜索，或者任何其他你所需要打开的网站，网址中的{q}是代表你输入的关键字，发挥你的想象力吧。 ###丰富插件同样是在Wox里键入 settings 并回车进入设置界面，Plugins 一页中便是你目前安装的插件。你可以在这里启用/禁用或者设置你的插件。你可以在这里找到Wox的插件下载，下载回来的是 .wox格式的文件，直接拖放到Wox的搜索框上，软件就会提示你是否安装了。 如上图，我在安装了 Youdao translator (有道翻译) 这款插件之后，就可以通过输入「yd 单词」直接进行中英文翻译了。 目前Wox已经有不少实用的插件了，如豆瓣电影、雅虎天气、进程关闭器、URL编码、关闭显示器、剪贴板历史、Windows最近使用文档等等……更多的Wox插件下载以及它们使用方式，大家可以前往这里获取，限于篇幅这里就不介绍更多了，大家亲身去尝试吧。 ###快速计算Wox还能进行一些简单的数学运算，可以非常方便地随手进行计算，并且回车后还可以复制计算结果。 ###特性总结 可以搜索本机安装的程序，支持中文拼音模糊搜索 搜索浏览器书签 瞬间搜索出本地硬盘所有文件（通过 Everything 插件） 网页搜索功能，可以给某个网址设置关键字例如搜索google，可以用g 搜索内容 支持插件扩展 支持自定义主题 ##Listary如果你是一个追求效率的人，你一定对Windows系统的资源管理器和文件搜索对话框有所不满。上一期我介绍的Directory Opus可以替代Windows资源管理器的核心功能，并且在功能上更为丰富，这款软件据我所知，国内使用者寥寥，推荐各位读者去试一试。但是Directory Opus的自带搜索功能速度也不快，并且无法替换各个软件打开文件时调用的文件查找对话框。Listary能够很好的弥补这一缺憾。如果你现在已经在使用Everything，我也推荐你换到Listary上，它比Everything更强大。不管我们用什么软件，打开一个文件总是离不开Windows的查找对话框（就是下图中的那种）。它令人不快的地方在哪里呢？基本上你每次看见它，接下来总是免不了一番思索：“我要打开的文件在哪里呢？”然后是一番点击，打开一个又一个文件夹，点错了以后返回，记性运气不好的话，一两分钟的时间是免不了了。而Listary绝对是能够解救你的一款神器。自从我用上了它，就再也离不开。下面我来说说它到底神在哪里？ ###即时搜索用过Google的都知道，Google可以在搜索框输入的同时实时显示搜索建议和结果，Listary也有这一强大功能。当你想打开一个文件，却只记得文件名开头几个字母的时候，你只需要变输入边看显示出来的结果，Listary就可以实时的显示出来相关的结果，大多数时候，里面就有你想要的。 ###超快全盘搜索Windows资源管理器自带的搜索功能可能比树懒快不了多少，而且只能搜索当前目录。如果你有一个文件搁置在电脑的某个角落，要找到它可不是一件容易的事。Listary可以让这一切变得简洁快速。任意窗口下，按下快捷键，即可呼出Listary搜索框。输入文件名，即可搜索当前目录下的文件，如果想搜索其他位置，前面加一个“>”，就可以搜索电脑中所有位置，结果几乎立刻出现。带来的效率提升不言而喻。 ###文件查找对话框增强安装了Listary以后，无论你在什么软件中打开文件查找对话框，在对话框的下面会跟着一个Listary对话框。你可以直接在这个对话框中输入你想找的文件名，享受Listary带来的即时搜索、全盘查找、历史记录等一系列优秀特性，找到文件后按下Enter，对话框将立即定位到文件所在位置。如果有一个已经打开的文件管理器，当你复制地址栏的地址以后，无需任何操作，Listary会自动帮你定位到相应位置。可以说，有了Listary的帮助，文件查找才真正具有它本来应有的高效。 ###其他增强特性Listary还有其他特性，比如自动记忆搜索历史，将使用频率最高的文件排在前面；对搜索到的任意文件按下右方向键，即可进行一系列操作，比如打开所在文件夹、复制、剪切等等。可以说，围绕着文件搜索这个痛点，Listary已经做到了极致。为了你自己宝贵的时间，我建议读者认真学习一下这个软件。 ##RolanRolan是一款图形化的软件启动器，它像Win10开始菜单的mini版。它的界面美观程度和功能性都是软件启动器中的佼佼者。和前面两个键盘流的快捷启动类的软件不同的是，Rolan主要通过鼠标操作。可以通过拖动点击将自己常用的快捷方式加入启动器的不同分组中。软件提供了丰富的设置选项，可以根据个人的偏好进行定制。 #快捷操作——WGestures &amp; AutoHotKey 软件获取地址：WGestures；AutoHotKey ##WGestures——全局鼠标手势WGestures是一款什么软件呢？一言以蔽之：Windows系统上的全局鼠标手势。用过浏览器上的鼠标手势插件的同学都能体会到鼠标手势的方便之处，而WGestures将鼠标手势功能带到了整个系统。你可以在桌面上，在文件管理器里，在任何一个软件里使用你自定义的鼠标手势功能，而且你可以为每个软件定义不同的手势，或者禁用手势功能。除了鼠标手势外，WGestures还有触发角功能，触发角的意思是，将鼠标指针移到电脑屏幕的四个角，无需任何点击，就相当于按下相应的快捷键。默认左上角和右上角用来切换程序，左下角打开开始菜单，右下角显示桌面。WGestures的官网上有清晰明了的视频介绍，这里不再赘述。 ##AutoHotKeyAutoHotKey是一款按键自定义和自动化操作软件。和按键精灵类似，但是开源免费、功能更强。通过编写语法简单的代码实现很多操作的自动化。有一定的入门门槛，适合进阶用户使用。 #小巧强大——PicPick &amp; 1ClipBoard 软件获取地址：PicPick；1ClipBoard ##PicPick——高颜值全能截图软件这是个看脸的社会，比看脸更残酷的是，比你长得帅的还比你用功。截图的软件多如牛毛，微信可以，QQ可以，各种输入法也可以，为啥要用这个PicPick呢？因为PicPick就是“宋仲基”般的理想男友。 颜好：Modern风格界面，精致、简洁； 专一：只关心截图，不想其他的； 能力强：各种方便的编辑、辅助工具，比如屏幕标尺，图章等等。还带多标签页，可以同时截取编辑多个图片。分享功能一键发送至办公软件。 还有什么好说的呢，喜欢就用吧。 ##1ClipBoard——剪贴板增强“Ctrl+C”，“Ctrl+V”，大家都不陌生。却少有人关心这两快捷键幕后的功臣剪贴板。当你“Ctrl+C”以后，内容会被存储到剪贴板上，然而一般情况下，在你黏贴出来之前，你是看不到的。更令人烦恼的是，一旦你复制了新的内容，之前复制的就会被覆盖，想要重新复制，你得找到原来的地方，再“Ctrl+C”一次。1ClipBoard能够让剪贴板变得前所未有的强大。它能够自动记录剪贴板的所有历史，无论是文字还是图片，无论是一个小时前复制的，还是一天前复制的，它都能够保存下来，当你需要的时候，按下快捷键，它会自动在不同的复制内容上编号，你只需要按下对应的数字，即可将内容重新复制到当前的剪贴板。如果觉得某个内容重要，还可以收藏进收藏夹。1ClipBoard和PicPick来自同一个公司，自然颜值也不低。也许你一时半会儿体会不了它的好处，但是，相信我，等你需要的时候，你会庆幸幸好有这样一个软件。 #更美的世界——Mactype、f.lux 软件获取地址：Mactype；f.lux ##Mactype——字体渲染引擎Mactype是个啥？有过苹果Mac OS的都有一个感觉，就是Mac上的字体比Windows清晰美观了不少。除了高分屏的影响外，这个和系统所用的字体渲染引擎有关。经过渲染的字体会显得更清晰、厚重、美观。Mactype的作用就是按照不同的方案对Windows上的字体进行渲染。话不多说，看下面这张图就行了。这个软件属于“一用就回不去”系列，一旦你习惯了更美观的字体，你就再也忍受不了Windows原生的丑陋效果了。谁都喜欢漂亮的东西，所以你也应该会喜欢Mactype吧。使用时推荐选择注册表加载方式，可以避免很多兼容性问题。 ##f.lux——呵护眼睛f.lux是一款根据你所在地理位置的日出和日落时间自动调节屏幕亮度和色温的软件，据说能够缓解眼疲劳，感兴趣的可以试一试。","categories":[],"tags":[]},{"title":"","slug":"Python-小白的入门实战——利用百度API自动获取数据","date":"2018-01-13T08:27:04.689Z","updated":"2018-01-13T08:26:52.000Z","comments":true,"path":"2018/01/13/Python-小白的入门实战——利用百度API自动获取数据/","link":"","permalink":"https://jerrynju.github.io/2018/01/13/Python-小白的入门实战——利用百度API自动获取数据/","excerpt":"","text":"#前言我是一名Python小白，两个礼拜之前还对Python一无所知，上次我利用举办社团活动的契机，请学校老师做了一次Python入门讲座。听闻Python功能强大，对初学者也很友好，于是抱着初生牛犊不怕虎的精神，尝试尝试用Python来解决一个复杂的难题。 #问题旅游爱好者小龙有钱又有时间，她决定制定一个详尽的旅行计划，游遍目前中国的热门景区。目前手边仅有的资料就是一份想要游览的景区的名单（如下图，总共有两百多个景点），其中主要是国家评定的5A级景区，制定怎样的旅行计划，才能最高效的游遍所有的景区呢？ #问题解决的思路首先这是一个非常具有现实意义的问题，它的核心是旅行商问题（Traveling Salesman Problem），也就是已知地点和地点之间的距离，找出游遍所有地点的最短路线。这是一个计算机领域的NP完全问题。TSP问题的核心算法有很多人已经研究过了。然而我们要解决的并不是一个纯数学的问题，而是一个实际问题。难点其实在于数据的搜集和整理。经过一番艰难的思索和尝试，我列出了下图所示的程序设计思路。其主要思想在于利用百度提供的免费API接口，获取各个景点的地理位置、地址，附件机场、车站以及景点之间的路线等各种信息，再将获得的json文件进一步处理，得到格式化的数据，导入TSP路径求解器，获得最优路径，再将最优路径在地图中表示出来，并给出详细的形式指南。 这是一个尚在进行中的浩大工程，尤其对于一个Python新手来说。 #学习Web API的调用Web API是一种应用程序接口，通过一定的设置之后，程序可以通过发送不同网址查询所需的数据。API的使用需要申请密钥，本文中使用的到的密钥均可以免费获取。地理服务相关的API有不少，比较成熟的是百度和谷歌两家。虽然很多时候谷歌的服务都显得高大上许多，但是经过一番尝试，在地图服务，尤其是国内的地图服务上，百度有很多优势。除去连接的稳定性之外，百度的所有Web API共享一个密钥，而谷歌需要为不同的API分别申请密钥，而且百度对中文支持完善，所以这里主要使用了百度地图的Web API服务。用户可以到这个地址申请：http://lbsyun.baidu.com/ 除了地图之外，百度还有一个API商店，提供了很多免费的API服务，网址：http://apistore.baidu.com/ #Python程序调用Web API的程序其实相当简单，笔者作为一个小白没花多长时间就捣鼓出了一段代码。12345678910111213141516171819202122232425262728293031323334353637383940414243444546474849505152535455565758596061626364656667686970717273747576777879808182838485868788899091929394959697# -*- coding: utf-8 -*-'''Created on 17-June-2016 @Jerry用于调用百度地图和去哪儿网的web api。'''import sys,urllib2,urllib,os#===============================================================================#读取API Key--------------------------------------------f_key = open(\"API Key.txt\",mode='r')key = []for line in f_key.readlines(): line = line.strip('\\n') key += [line.split(\",\")]apikey = dict(key)f_key.close()#------------------------------------------------------#读取API Url--------------------------------------------f_url = open(\"API Url.txt\",mode='r')url = []for line in f_url.readlines(): line = line.strip('\\n') url += [line.split(\",\")]apiurl = dict(url)f_url.close()#------------------------------------------------------#===============================================================================#===============================================================================#查询百度地图API-------------------------------------------class BaiduQuery: def __init__(self,api,args,name): self.api = api #调用的API名称 self.args = args #查询变量 self.name = name #查询结果的命名方式 def getjson(self): baseurl = apiurl[self.api] self.args[\"ak\"] = apikey[\"BaiduMap\"] self.args[\"output\"] = \"json\" encodeargs = urllib.urlencode(self.args) url = urllib.unquote(baseurl + encodeargs) routeDir = \"Data/\"+self.name+'/'+self.api+'.json' urllib.urlretrieve(url, routeDir) print self.name,self.api,\" -&gt; Success\" def makedir(self): #文件夹是否已创建 if not os.path.exists(\"Data/\"+self.name+\"/\"): os.makedirs('Data/'+self.name+'/') print \"Make Dir Successfully!\" return 1 else: return 0#------------------------------------------------------#===============================================================================#查询百度API商店中去哪儿网火车票、景点门票--------------------------------------class QunarQuery: def __init__(self,api,args,name): self.api = api #调用的API名称 self.args = args #查询变量 self.name = name #查询结果的命名方式 def getjson(self): baseurl = apiurl[self.api] encodeargs = urllib.urlencode(self.args) url = urllib.unquote(baseurl + encodeargs) routeDir = \"Data/\"+self.name+'/'+self.api+'.json' req = urllib2.Request(url) req.add_header(\"apikey\", apikey[\"Qunar\"]) resp = urllib2.urlopen(req) content = resp.read() if(content): with open(routeDir, \"wb\") as code: code.write(content) print self.name,self.api,\" -&gt; Success\" def makedir(self): #文件夹是否已创建 if not os.path.exists(\"Data/\"+self.name+\"/\"): os.makedirs('Data/'+self.name+'/') print self.name,\" -&gt; Make Dir\" return 1 else: return 0#------------------------------------------------------#===============================================================================#使用示例-----------------------------------------------# values=&#123;# \"version\":\"1.0\",# \"from\":\"上海\",# \"to\":\"南京\",# \"date\":\"2016-06-18\"# &#125;# ID23 = QunarQuery(\"QunarTrain\",values,\"23\")# ID23.makedir()# ID23.getjson()#=============================================================================== 这段代码将需要查询的信息编码到网址中，其中两个本地txt文件中存放的是申请的API Key和各种不同的Web服务的网址。网址在官网都可以查询到，需要注意的是网址后面要手动加上一个“？”。由于百度地图的API和百度API商店中的API调用略有不同，因此写了两个class，不知道大牛能不能将两个class合并成一个。在调用不同的服务的时候，输入相关参数，将返回的json文件存储到本地相应景点编号下的文件夹中。 #json文件的处理本文中用到的API返回的都是json格式的文件（如下图）。看起来密密麻麻，作为小白的我当然是没听说过这是个啥啦。一番百度之后，找到了一个很好的在线工具json在线编辑器，可以将json文件重新排版，并且给出文件结构树，相当方便。格式化之后的文件就好看了许多，可以看到里面包含了两地之间的火车票信息，这是通过qunar的接口获得的数据。json文件的处理笔者还没有摸索出最优的方法，等搞清楚了再来写一写。 #中国的景点分布图在我之前的尝试中，我试着用Python的Basemap和GeoPy包解析处理这两百多个景点的具体经纬度信息，当然后来发现还是百度地图的API最直接最方便。获取的这些数据直接绘制出来就是下面的效果，图中的深蓝色小点就是中国5A景区所在地：在通过flight100网站获得全世界所有机场和航线的数据之后，我又将其中中国的数据筛选出来，绘制出了中国的机场和航线分布图。当然用Basemap只能绘制出简单的静态图，有没有办法让辛辛苦苦获得的这些地理数据发挥更大的用处呢，当然是可以的。 #将地理数据导入Google Earth输出上，你可以将地理位置数据导入到Google Earth中。只是在导入之前还需要一番处理。Google Earth使用的是一种特殊格式的kml文件，你可以在这个网站将可以在Excel中打开的csv格式文件在线转换成kml文件，然后直接拖入Google Earth软件，谷歌地球会帮你自动标注出来，效果就像下面这张图，里面的各个景点都用小图钉标注了出来。为什么说这些数据能在谷歌地球中发挥更大价值呢？这是因为谷歌地球自带了很多图片。尤其是其中的Panoramio照片，能够将景点周边的真实面貌以高清照片的形式展现出来，让你提前预览美景之后，再决定要不要前往。 #未完待续","categories":[],"tags":[]},{"title":"","slug":"Alteryx——超越Excel的数据处理新秀","date":"2018-01-13T08:27:04.686Z","updated":"2018-01-13T08:26:52.000Z","comments":true,"path":"2018/01/13/Alteryx——超越Excel的数据处理新秀/","link":"","permalink":"https://jerrynju.github.io/2018/01/13/Alteryx——超越Excel的数据处理新秀/","excerpt":"","text":"近年来大数据领域异常火爆，充多优秀的软件相继涌现，比如功能强大的Tableau。我在学习Tableau的过程中无意间发现了另一款数据处理工具Alteryx。这款软件国内知之者甚少，几乎搜不到相关的学习资料。然后初步尝试之后，我发现它是一款神器级别的应用，颠覆了我以前对数据处理的既有映像。在此做一些简单的科普，希望更多的朋友能够去尝试它。 #初识AlteryxAlteryx的界面如图所示。它没有通常的数据处理软件的一大堆菜单和选项，取而代之的是一系列可以拖动的模块化小工具。这些小工具按照各自的功能分门别类存放在不同的选项卡下。每一种类别的工具具有不同的颜色和形状。这些小工具可以拖动到下方面板中，并且自动通过线段相互连接。这一模式类似于Matlab的Simlink之类的仿真模拟软件，只不过处理的对象换成了各种格式的数据文件。这些小工具的组合实现了Alteryx的几乎所有功能。但是这种方式弊端也很明显，那就是难上手。新手很难通过看图标来搞清楚各个小工具的作用，再加上这款软件只有英文版，大大加大了上手的难度，或许这就是为什么国内使用者寥寥的一大原因。不过好消息是，软件为每一个小工具都提供了详细的使用案例。这些案例图文并茂，步骤清晰。只有按照案例的文字指示耐心地操作一遍，掌握工具的使用基本没有什么问题。 #Alteryx的威力Alteryx不仅仅是一款数据处理软件，它是一个数据获取、清洗、分析、展示的综合平台。并且它的威力建立在十分友好的操作方式的基础上，你不需要掌握复杂的编程语言，不需要记忆种类繁多的命令。只需要拖动小工具、设置参数、连接小工具、运行，就能够完成数据处理工作。我们来看这样一个略微复杂的例子：创建一个APP，它能够根据你输入的地址自动获取该地址对应的GPS坐标，并且将该坐标附近的地图以PDF格式输出。我们的gps查询功能是通过百度地图提供的Geocoding API来实现的，因此首先你需要申请一个免费的Key。下面一种图展示了其中各个工具的作用。要使用这个工具，我们先点击View菜单中的Interface Designer打开界面设计器。其中只有一个用来输入地址的输入框。然后我们点击工具条上的小魔法棒按钮就可以运行程序。我们输入“天府广场”试试看，输入完毕之后点击Finish。出现一个进度条显示程序运行进度。运行完毕显示运行结果，点击OK按钮，PDF文件自动打开。最后生成的是一个包含地图的PDF文件，里面用蓝色小点标注出了我们检索的地点。需要注意的是，标注有可能不准确，因为国内使用的GPS坐标经过加密，标注时可能会发生偏移。Alteryx的整个工作思路就是这样。 #无穷的想像空间上面的例子当然非常简单，输出的结果也不是十分美观。但是这个例子结合了GUI界面生成、网络数据获取、json文件处理、地图自动生成等一系列复杂功能，这些功能使用Excel这样的软件很难实现，即使使用Python这样的编程语言也是破费心力的。虽然我刚接触Alteryx，也只花了一两个小时的时间就初步达成了目的，Alteryx的简洁易用可见一斑。除了数据处理，Alteryx的另一强大之处在于其数据分析功能，你可以利用现有组建构建模块化的宏组件，也可以直接使用R语言代码来进行数据分析。可以说其拓展空间是无限的。 #一个坏消息作为一个新兴软件，由于使用者较少，Alteryx目前没有破解版，而且其价格昂贵，每人每年的售价高达三四万人民币。官方目前只提供14天试用，如果有大神有能力的话，可以尝试造福一下大家。","categories":[],"tags":[]},{"title":"","slug":"世上最强大的科研工具手册","date":"2018-01-13T08:27:04.680Z","updated":"2018-01-13T08:26:52.000Z","comments":true,"path":"2018/01/13/世上最强大的科研工具手册/","link":"","permalink":"https://jerrynju.github.io/2018/01/13/世上最强大的科研工具手册/","excerpt":"","text":"本文转载自网络 ，经过简单整理和标注。笔者自己亲测过的靠谱工具已用斜体加粗标注。同时加入了一些适合国内环境的工具/网站。本文不断更新中，希望有能力的朋友可以到这个网页共同完善这个列表。原网页PDF版本下载，链接：http://pan.baidu.com/s/1bd7Ru2 密码：2s0x Explore the literature 文献Here is a collection of digital tools that are designed to help researchers explore the millions of research articles available to this date. Search engines and curators help you to quickly find the articles you are interested in and stay up to date with the literature. Article visualization tools enhance your reading experience, for instance, by helping you navigate from a paper to another. Search engines and curators 搜索 虫部落学术搜索：最全的学术搜索引擎之一，集成了国内外最常见的学术搜索服务。 X-mol化学平台：专注化学领域，搜索功能一般但是资讯更新及时，推荐关注其微信公众号。 LibraryGenius：最全的电子书搜索网站，可以搜索到很多国外稀缺原版教材。 SciHub：SCI文献下载第一站。recommended by leileely BibSonomy – Share bookmarks and lists of literature. CaptoMe – Metadata platform with rich biomedical content and information management tools for well-organized research. CiteUlike – Search, organize, and share scholarly papers. Colwiz – Create citations and bibliography and set up your research groups on the cloud to share files and references. ContentMine – Uses machines to liberate 100,000,000 facts from the scientific literature. Data Elixir – A weekly collection of the best data science news, resources, and inspirations from around the web. DeepDyve – Instant access to the journals you need. EvidenceFinder – Enriches your literature exploration by suggesting questions alongside your search results. (blog post) F1000 – Leading biomedical experts helping scientists to discover, discuss and publish research. Google Scholar – Provides a way to broadly search for scholarly literature across disciplines and sources. Labii – A suite of web apps for researchers, including an online app for finding, commenting, rating and managing research papers. (blog post) LazyScholar – Chrome extension to help your literature search. Mendeley – A unique platform comprising a social network, reference manager, article visualization tools. Microsoft Academic Search – Find information about academic papers, authors, conferences, journals, and organizations from multiple sources. MyScienceWork – Diffuse scientific information and knowledge in a free and accessible way. Nowomics – Follow genes, proteins and processes to keep up with the latest papers and data relevant to your research. Paperity – Aggregator of open access papers and journals Paperscape – Visualise the arXiv, an open, online repository for scientific research papers. PubChase – Life sciences and medical literature recommendations engine. (blog post) Pubget – Search engine for life-science PDFs. PubNiche – A scientific research news curator. PubPeer – Search for publications and provide feedback and/or start a conversation anonymously. ReadCube – Read, manage &amp; discover new literature. Research Professional – Source of intelligence on funding opportunities and research policy. Scicurve – Transforms systematic literature review into interactive and comprehensible environment. Sciencescape – Innovation in the exploration of papers and authors. Scientific Journal Finder (SJFinder) – A collection of tools including a journal search engine and rating which recommends a list of journals based on title and abstract of scientific manuscript, website builder, .(blog post) SciFeed – Uses various data sources and natural language processing to identify important new scientific advances. SciVal Funding – Comprehensive source of funding information. Scizzle – Curator that automagically finds new and relevant research papers. (blog post) Sparrho – Personalized recommendation engine for science – allowing you to keep a bird’s eye view on all things scientific. SSRN – Multi-disciplinary online repository of scholarly research and related materials in social sciences. Symplur – Connecting the dots in healthcare social media. Wiki Journal Club – Open, user-reviewed summaries of the top studies in medical research. Zotero – Helps you collect, organize, cite, and share your research sources. Article visualization 管理 ACS ChemWorx – Collaborative reference manager coupled with tools and services for authors. Colwiz – Create citations and bibliography and set up your research groups on the cloud to share files and references. eLife Lens – Provides for researchers, reviewers, authors and readers a novel way of looking at online content. Elsevier “Article of the Future” – Aims to revolutionize the format of the academic paper in regard to presentation, content and context. Interactive Science Publishing – Allows authors to publish large datasets with original source data that can be viewed interactively by readers. Mendeley – A platform comprising a social network, reference manager, article visualization tools. Pubget – Search engine for life-science PDFs. PubReader – Alternative web presentation that offers another, more reader-friendly way to read literature in PMC and Bookshelf. ReadCube – Read, manage &amp; discover new literature. Utopia Docs – Pdf reader that connects the static content of scientific articles to the dynamic world of online content. Wiley Anywhere Article – Enhanced HTML article from Whiley publisher. Wiley Smart Article – Enhanced article tools for chemistry content in Whiley journals. Find and share data and code 数据和代码Managing large sets of data and programing code is already unavoidable for most researchers. Tools have been developed to efficiently store and share data and code. These tools are become increasingly important as data and code sharing becomes the norm and a requirement of most funding agencies. Github：最大的程序员同性交友代码共享平台，做理论模拟的同学可以在上面找到很多开源代码。 BioLINCC – Clinical specimen database. ContentMine – Uses machines to liberate 100,000,000 facts from the scientific literature. DataBank – Analysis and visualisation tool that contains collections of time series data on a variety of topics. DataCite – Establish easier access to research data by providing persistent identifiers for data. DataHub – Publish or register datasets, create and manage groups and communities Dataverse Network – Harvard-based tool to share, cite, reuse and archive research data. Dryad– Data repository for any files associated with any published article in the sciences or medicine. Figshare – Manage your research in the cloud and control who you share it with or make it publicly available and citable GenBank – Gene sequence database provided by the National Center for Biotechnology Information. GitHub – Online software project hosting using the Git revision control system. Nowomics – Follow genes, proteins and processes to keep up with the latest papers and data relevant to your research. Open Science Framework – Gathers a network of research documents, a version control system, and a collaboration software. Peer Evaluation – Open repository for data, papers, media coupled with an open review and discussion platform. Quip – Combines chat, documents, spreadsheets, checklist, and more to collaborate on any device. re3data – Global registry of research data repositories. Research Compendia – Tools for researchers to connect their data, code and computational methods to their published research SlideShare – Community for sharing presentations and other professional content Socialsci – Help researchers collect data for their surveys and experiments (blog post). Zenodo – A home for the long-tail of science, enabling researchers to share and preserve any research outputs. Connect with others 学术社交圈Research cannot stay buried in the lab anymore! Under Connect with experts and researchers, you will find a set of tools that help researchers reach out to other researcher and find expertise for new collaborations. Under Outreach, find tools that help you communicate your research to the general public. Citizen science, gathers tools to help you involve the general public in your research efforts, by sharing CPU time, or counting birds for example. And under Crowdfunding, you will find tools that help you collect funds for research from others. Connect with experts and researchers Academia – A place to share and follow research and researchers. AcademicJoy – Share research ideas and story in research and innovation. Addgene – Connect with other researchers through this plasmid sharing platform. AssayDepot – Pharmaceutical marketplace for life science research services. Benchling – Life science data management and collaboration platform. BiomedExperts – Scientific social network to research, collaborate, and connect with researchers and medical experts worldwide. BiomedUSA – Global open access hub for sharing and licensing of Biological Research Materials and related technologies. Biowebspin – Platform in life science worldwide to networks, work, look up information. Cureus – A free and open access the medical journal and a place for physicians to build a digital CV. Direct2experts – A federated network of biomedical research expertise. Expertnet – Helps you locate experts in Florida universities. GlobalEventList – A comprehensive directory of scientific events worldwide. Innocentive – Helps clients to engage a world of creative and diverse on-demand talent to rapidly generate novel ideas and solve important problems. Journal of Brief Ideas – Provides a place for short ideas to be described – in 200 words or less -, archived, searchable and citable. Kaggle – Connect with organisation in need of data prediction algorithms through open competitions for the best code. (blog post) LabRoots – Social network for researchers. LifeScience.net – Online platform for professional networking and sharing of knowledge in life sciences. Linkedin – Professional networking site for all. Loop – Open, cross-platform network for researchers and academics from the Frontiers journals. MalariaWorld – The world’s scientific and social network for malaria professionals. Mendeley – A unique platform comprising a social network, reference manager, article visualization tools MyScienceWork – Diffuse scientific information and knowledge in a free and accessible way. nanoHUB – Centralized platform for computational nanotechnology research, education, and collaboration. Open Science Framework – Gathers a network of research documents, a version control system, and a collaboration software. Piirus – Helps researchers meet potential collaborators, build networks and develop their core research. Profeza – Showcasing the unvalued work behind each article to provide new, more accurate way of evaluating researchers. Profology – A professional community created exclusively for higher education faculty, staff and administrators. Research Connection – A searchable platform for research jobs and information. ResearchGate – Social network for researchers. ScienceExchange – Marketplace for shared lab instrumentations. (blog post) SocialScienceSpace – Social network to bring for social scientists. Trellis– A digital platform that connects you to the rest of the scientific community, ran by AAAS. Outreach Stork：文献推荐系统，输入关键词，直接将最新文献推送到你邮箱。 SciReader：个性化文献推荐系统，输入相关信息，可以分别推送你感兴趣的文献、tweet上讨论最多的文献、以及ScienceDaily最新科学新闻到你邮箱。 AcademicJoy – Sharing research ideas and story in research and innovation. AcaWiki – Summarizing academia and quasi-academia, one document at a time. DrawScience – Take science articles, make pictures. I Am Scientist – A science outreach education and engagement activity. Kudos – Helps researchers explain, enrich and share their publications for greater research impact. nanoHUB – Centralized platform for computational nanotechnology research, education, and collaboration. Publiscize – Empowering scientists to free science and make their research available to everyone. ScienceGist – Simplified summaries of scientific papers. (blog post) SciVee – Science video sharing platform. SciWorthy – A science news site for the everyday person to better understand science. Useful Science – Summaries of the latest science useful in life. Citizen science Folding@home – Distributed computing project which studies protein folding, misfolding, aggregation, and related diseases. Innocentive – Helps clients to engage a world of creative and diverse on-demand talent to rapidly generate novel ideas and solve important problems. Kaggle – Platform for data prediction competitions. Patient Innovation – Nonprofit, international, multilingual, free venue for patients and caregivers of any disease to share their innovations. Project Noah – Explore and document wildlife on this citizen scientists platform. SciStarter – Find, join, and contribute to science through recreational activities and citizen science research projects. SETI@home – Put your CPU to work to help detect intelligent life outside Earth. Zooniverse – Citizen science projects using the efforts and ability of volunteers to help scientists and researchers. Crowdfunding Benefunder – Facilitates connections with top researchers who are working on breakthrough discoveries that are impacting our world. Experiment – Crowdfunding Platform for Scientific Research. My Projects – Donate to the research work that means the most to you. Petridish – Fund science &amp; explore the world with renowned researchers. SciFlies – Allows anyone, anywhere to directly support research they care about. Consano – Research crowdfunding site to directly support innovative medical research that matters to you At the bench and in the offic 日常工作Here is a collection of tools that help researchers in their everyday tasks. Go to Lab and project management**, for tools that help manage stocks and equipments in the lab as well as project management tools for research. You’ll also find a selection of Electronic lab notebooks developed with academic researchers in mind first. Many others are available elsewhere. Outsourcing experiments is increasingly common in academic research, in part thanks to several sites that are making it easier and cheaper. Platforms to Find and share samples help you disseminate and find materials and biological samples. Under Protocol repository, you will find a collection of publicly accessible resource for experimental protocols. Work with code gathers tools designed to make the coder’s life easier and Work with data** tools to generate and analyze data sets, including many R-based tools. Lab and project management 1degreebio – Reagent marketplace. Antibody Registry – Gives researchers a way to universally identify antibodies used in in the course of their research. Asana – Keeps your team organized, connected, and focused on results. Biocompare – Find products, read reviews and hear about the latest technological developments. ELabInventory – Web-based laboratory inventory management system designed for life science research laboratories LabCritics – Provides researchers with a trust-able source of lab equipment reviews and comparisons. LabGuru – Supports day to day activities of a research group, from vision to execution, from knowledge to logistics. Lab Suit – Inventory Management, orders Management, materials Trade-In, price Comparison. Life technologies Lab Management Tool – Management tool for lab equipment and services. Open Science Framework – Gathers a network of research documents, a version control system, and a collaboration software. Quartzy – A free and easy way to manage your lab. Quip – Combines chat, documents, spreadsheets, checklist, and more to collaborate on any device. StrainControl – Lab management tools that allows you to organize strains, plasmids, oligos, antibodies, chemicals and inventorie. Synapse – Platform to support open, collaborative data analysis for clear, reproducible science Electronic lab notebook Docollab – Helps you manage your scientific research, collaborate with your colleagues and publish your findings. elabftw – Electromic lab notebook made by researchers, for researchers, with usability in mind. Evernote – A place to collect inspirational ideas, write meaningful words, and move your important projects forward. Findings App – Lab notebook app that allows to organize your experiments, keep track of results, and manage your protocols. Hivebench – Hosted numeric laboratory notebook tool to manage protocols, experiments and share them with your team. Journal Lab – A community of scientists who share open summaries and peer review of published articles. (blog post) LabArchives – Web-based product to enable researchers to store, organize, and publish their research data. Labfolder – Simple way to document your research and to organize your protocols and data. (blog post) LabGuru – Supports day to day activities of a research group, from vision to execution, from knowledge to logistics. Laboratory Logbook – Document projects running in a lab and manage experimentally obtained data and its metadata. sciNote – Open source lab notebook with workflows and modular functionalities. (blog post) Sumatra – Automated electronic lab notebook for computational projects. Outsourcing experiments Emerald Cloud Lab – A web-based life sciences lab, developed by scientists for scientists. ScienceExchange – Marketplace for shared lab instrumentations. (blog post) TetraScience – Allows you to monitor &amp; manage your experiments from anywhere. Transcriptic – A remote, on-demand robotic life science research lab with no hardware to buy or software to install. Find and share samples Addgene – Plasmid sharing platform Antibody Registery – Gives researchers a way to universally identify antibodies used in in the course of their research. Biospecimens – Platform for biospecimen-based research. Duke human heart – Repository for cardiovascular research scientists, including tissues samples and information. ELabInventory – Web-based laboratory inventory management system designed for life science research laboratories. Nanosupply – Platform facilitating sourcing and sharing of advanced materials for research and education. Sample of Science – Peer-Sharing Platform for Scientific Samples. (blog post) Protocol repository SciVee – Science video sharing platform that includes protocols. Benchfly – Video protocols and video platform for scientists. Benchling – Life science data management and collaboration platform, where you can create, find, and discuss protocols. IPOL journal – Research journal of image processing and image analysis with algorithm descriptions and its source code. MyExperiment – Share workflows and in silico experiments. OpenWetWare – Share information, know-how, wisdom, and protocols among researchers working in biological fields. Pegasus – Platform that help workflow-based applications execute. Protocols – Crowdsourced universal protocol repository. (blog post) Protocol online – A curator of protocols contributed by researchers arounds the world. Scientific Protocols – Share scientific protocols using the GitHub platform. Work with code Sublime Text：界面简洁美观、功能强大的文本编辑器。 CDE Tool – Deploy and run your Linux programs on other machines without any installation or configuration. Dexy – Helps your code to speak for itself with beautiful syntax highlighting. GitLab – A git repository management, code reviews, issue tracking and wiki’s all in one platform. iPython notebook – Interactive computational environment that allows code execution, text, mathematics, plots, and rich media. Kepler – Helps create, execute, and share models and analyses across scientific and engineering disciplines. Mercurial – Control management tool with distributed source, giving each developer a local copy of the development history. nanoHUB – Centralized platform for computational nanotechnology research, education, and collaboration. ROpenSci – Packages that allow access to data repositories through the R statistical programming environment. Sweave – Allows to embed the R code for complete data analyses in latex documents System in Cloud – Platform, enabling clients to rapidly draw and execute data-flow diagram that run in cloud. Work with data MobaXterm：功能完善的SSH终端，用来远程连接服务器，适合有大规模计算需求的同学。 Benchling – Life science data management and collaboration platform. Galaxy Project – Web-based platform for data intensive biomedical research. GenePattern – Genomic analysis platform that provides access to hundreds of genomics tools. GenomeCompiler – Genetic design platform allowing researchers to manipulate and design everything from single genes to entire genomes. InSIlico DB – Genomics made possible for biologists without programming. Kaggle – Patform for data prediction competitions. Kitware – Advanced software solutions and services for data intensive R&amp;D mloss – Machine learning open source software. MyExperiment – Share workflows and in silico experiments nanoHUB – Centralized platform for computational nanotechnology research, education, and collaboration. Pegasus – Platform that help workflow-based applications execute. Plotly – Online tool to graph and share data. ROpenSci – Packages that allow access to data repositories through the R statistical programming environment. Statcrunch – Provides data analysis via the Web. Sumatra – Automated electronic lab notebook for computational projects SURF In context – Navigate through RDF relations in a smooth and understandable way. Sweave – Allows to embed the R code for complete data analyses in latex documents. Synapse – Platform to support open, collaborative data analysis for clear, reproducible science. System in Cloud – Platform, enabling clients to rapidly draw and execute data-flow diagram that run in cloud. Tableau – Easily and quickly analyze and present data and share insights. Taverna – A suite of tools used to design and execute scientific workflows. VisTrails – Scientific workflow and provenance management system that supports data exploration and visualization. Wakari – Web-based python data analysis. WebPlotDigitizer – Web based tool to extract data from plots, images, and maps. (blog post) Wings – Semantic workflow system that assists scientists with the design of computational experiments. Wolfram Alpha – Web-based tools for scientific calculations. World Map – Allows users to explore, visualize, edit, collaborate with, and publish geospatial information. Fundraising/Grantwriting Grant Forward – Search engine for research grants. Pivot COS – A database which includes funding opportunities from all disciplines. Write 写作Writing tools are adapting to the needs of researchers. Tools to store and manage references are grouped under Reference managers. And with research being more and more dependent on collaborations across labs and continents, collaborative writing tools, help researchers write their manuscript while keeping close track of the modifications done by others to the text. Reference managers Jabref：参考文献管理软件，同时支持Word和Latex，安装插件后可以方便的在Word中插入参考文献。 ACS ChemWorx – Collaborative reference manager coupled with tools and services for authors. CitationStyles – Find and edit CSL citation styles. Citavi – Reference management, knowledge organization, and task planning solution. CiteUlike – Search, organize, and share scholarly papers. Colwiz – Create citations and bibliography and set up your research groups on the cloud to share files and references. EndNote – Software tool for publishing and managing bibliographies, citations and references F1000 workspace – A workspace for scientists to collect, write and discuss scientific literature. Mendeley – A unique platform comprising a social network, reference manager, article visualization tools. Paperpile – No-fuss reference management for the web (Google docs plugin). (blog post) Papers – Helps you collect and curate the research material that you’re passionate about. Zotero – Helps you collect, organize, cite, and share your research sources Collaborative writing tools 石墨文档：文档、表格合作写作平台，小巧、简洁，支持微信直接登录，可以在微信上直接编辑文档。 ASCII doctor – Text processor &amp; publishing toolchain for converting AsciiDoc to HTML5, DocBook &amp; more. Atlas – Write, collaborate, design and publish on a single platform. Authorea – Platform to write scientific, academic, and technical documents in collaboration. (blog post) Draft – Version control and collaboration to improve your writing. F1000 workspace – A workspace for scientists to collect, write and discuss scientific literature. Fidus Writer – Online collaborative editor especially made for academics who need to use citations and/or formulas. Overleaf – Online collaborative LaTeX editor, with direct submission to several publishers (ex WriteLaTex) Penflip – Collaborative writing and version control. (blog post) Poetica – Get clear feedback, wherever you’re writing. ShareLaTex – Collaborative on-line editor for for Maths or Sciences. Stackedit – Markdown editor based on PageDown, the Markdown library used by Stack Overflow. Typewrite – A simple, real-time collaborative writing environment. Quip – Combines chat, documents, spreadsheets, checklist, and more to collaborate on any device. Publish 出版Open Access platforms offer an alternative publishing model, allowing anyone to visualize published work for free. Researchers can also maximize the exposure of their work by placing their manuscripts in Paper repositories. In addition to becoming more open, articles are bound to become more interactive. A set of tools allowing you to bring additional functionalities such as executable code to your articles are grouped under Support to publication. You can also find tools to help your choose from the thousands of journals in activity under Journal reviews and advisors. Open access platforms eLife – Open access to the most promising advances in science. F1000 – Leading biomedical experts helping scientists to discover, discuss and publish research. GigaScience – Online open-access open-data journal that publishes ‘big-data’ studies from the life and biomedical sciences. Limn – Free journal that outlines contemporary problems. PeerJ – Open access pre-print and publishing of life science research with annotation. Cureus – A free and open access the medical journal and a place for physicians to build a digital CV. ScienceOpen – Freely accessible research network to share and evaluate scientific information. The Winnower – Open access online science publishing platform that employs open post-publication peer review. Paper repositories ArXiv – E-prints in Physics, Mathematics, Computer Science, Quantitative Biology, Quantitative Finance and Statistics. biorXiv – The preprint server for Biology. F1000 – Leading biomedical experts helping scientists to discover, discuss and publish research. Figshare – Manage your research in the cloud and control who you share it with or make it publicly available and citable. Peer Evaluation – Open repository for data, papers, media coupled with an open review and discussion platform. Peerage of Science – Pre-publication peer review and publishing for scientific articles. PeerJ PrePrints – Pre-print repository for the biological and medical Sciences. SlideShare – Community for sharing presentations and other professional content. Zenodo – A home for the long-tail of science, enabling researchers to share and preserve any research outputs. Support to publication 期刊影像因子查询系统：查询期刊的最新影响因子。 Collage Authoring Environment – Framework for collaborative preparation and publication of so-called executable paper. Exec&amp;Share – Openly share the code and data that underlie your research publications. Google Charts – Create live and interactive charts in your browser. RunMyCode – Openly share the code and data that underlie your research publications. (blog post) ORCID – Provides a persistent digital identifier that distinguishes you from every other researcher. Journal reviews and advisors Cofactor Science Journal Selector – A journal selector from the editing service Cofactor. Edanz’s journal advisor – Personal guide that recommends the tools and services you need to get published. Journal Finder – Elsevier’s service that help you find journals that could be best suited for publishing your scientific article. Journal Guide – Find the best journal for your research. (blog post) Journal Reviewer – Aggregates information users provide about their experience with academic journals’ review processes. Journalysis – A service for academic authors run by academic authors for reviewing experiences with academic journals. RoMEO – Find out publisher copyright and self-archiving policies. SciRev – Share your experience with the scientific review process and learn from others to decide where to submit your manuscripts. (blog post) Evaluate research 影响力评估New tools are changing the way research in evaluated, both in terms of the scientific value of articles and the overall achievements of researchers. Find under Peer-review, a collection of tools that are changing the peer-review system into a more open and productive process by bypassing journals and editors. Altmetrics are a set of new tools that analyze the impact of you work by other means than impact factor and citations counts. Peer-review Academic Karma – Peer review and get peer reviewed faster. F1000 – Leading biomedical experts helping scientists to discover, discuss and publish research. Hypothes.is – Sentence-level peer-review to provide commentary, references, and insight on top of online content. Journal Review – Rate, and review published medical journal articles. Labii – A suite of web apps for researchers, including an online app for finding, commenting, rating research papers. (blog post) Libre – Participative reviewing platform (beta testing). Paper Critic – Review platform for research publications (Mendeley plugin). Peerage of Science – Pre-publication peer review and publishing for scientific articles. PeerJ – Open access pre-print and publishing of life science research with annotation. PubPeer – Search for publications and provide feedback and/or start a conversation anonymously. Publons – Record, showcase, and verify all your peer review activity. Pubmed Commons – Share opinions and information about scientific publications in PubMed. (blog post) Rubriq – Provides an independent peer review prior to submission. (blog post) ScienceOpen – Freely accessible research network to share and evaluate scientific information. Wiki Journal Club – Open, user-reviewed summaries of the top studies in medical research. The Winnower – Open access online science publishing platform that employs open post-publication peer review. Altmetrics Altmetric – Tracks what people are saying about papers online on behalf of publishers, authors, libraries and institutions. ImpactStory – Share the full story of your research impact. (blog post) PLOS Article-Level Metrics – A suite of established metrics that measure the overall performance and reach of research articles. PlumAnalytics – Research altmetric service tracking more than 20 different types of artifacts. Profeza – Showcasing the unvalued work behind each article to provide new, more accurate way of evaluating researchers. Publons – Record, showcase, and verify all your peer review activity. 整理不易，请点赞鼓励作者。关注本人简书账号可第一时间看到后续文章。","categories":[],"tags":[]},{"title":"","slug":"高效率科研神器——精致排版和绘图","date":"2018-01-13T08:27:04.675Z","updated":"2018-01-13T08:26:52.000Z","comments":true,"path":"2018/01/13/高效率科研神器——精致排版和绘图/","link":"","permalink":"https://jerrynju.github.io/2018/01/13/高效率科研神器——精致排版和绘图/","excerpt":"","text":"Word之外的另一个世界——TeX和它的朋友们广大科研搬砖工工作者常用的排版和绘图工具主要是以下几种：微软Office系列的Word、Powerpoint、Excel，Origin，Mathtype等等。这些软件都属于所见即所得类的软件，也就是说你在输入或者操作的同时能够实时地看到最终的输出结果。然而他们实际上只是理论上的所见即所得，在实际使用中，这些软件都或多或少的存在着以下这些缺点： 版本和兼容问题：同一个文件用不同版本的软件打开时，显示效果往往会有变化，最重要的是这种变化往往无法预知，难以避免。 格式与内容混为一体：在使用Word时，每输入一段文字，基本都要停滞一段时间，将键盘上连续打字的手移到鼠标上，点击软件上的各种按钮，设置格式。如果想等到完全输入完之后再修改格式，要么已经忘记了哪些地方需要修改，要么限于长时间的无聊的重复操作之中。 多软件的协同问题：我们在写论文或者做PPT的时候，总是免不了需要用到多个软件，比如用Excel处理数据，用Origin绘制图表。然而多个不同公司、不同类型的软件之间经常很难做到完美配合、合理分工。也许这里处理完的数据复制到那个软件里，格式就出了错，或者这里画的图在那个软件里发生了变形，产生了错误。这些情况不仅经常发生，而且很难解决，耗费了我们很多精力。 排版的细节问题：如果你看过国外排版精美的教科书，你也许会发现Word之类的软件排版出的文字有一种奇怪的感觉，文字之间的间隔、行与行之间的间距很僵硬。图片、表格和文字之间的结合也有一种粗糙感，显得不够专业。 相信每一个科研工作者或者几乎需要写作技术类文字的人都希望有一个更加完美的写作体系。这一个写作体系最好具有以下几个特点： 格式和内容的分离：输入内容的时间可以不考虑格式，修改格式的时候无需再回到具体的内容中。 美观而方便的公式输入：技术类文章中往往少不了公式，而传统的鼠标点击式的公式输入方式无疑是十分低效而丑陋的。 自动化的编号和引用系统：参考文献的编号和插入、章节的序号、目录的生成应该能够自动实现，不需要我们操心。 精确的、可自定义的绘图功能：示意图、流程图之类的图片中每一个元素的位置、大小、形状之类的参数应该是可以精确定义的，生成的图片应该是不受缩放影响的矢量格式。 一致的工作方式、丰富的可拓展性：无论是文字、公式、图片、还是表格、 参考文献都可以在一个软件里用一种方式生成，同时还能根据需要方便的植入其他功能。 也许有人会想，这么好的东西我怎么没听说过，应该还没出现吧。事实是，具有上述特点的写作系统不仅有、而且早就有了。然而由于一定的入门门槛，仅仅在相对较小的圈子中使用。然而，科研和技术工作者理应就是这一小圈子的目标受众，因此，我希望简单介绍一下Tex排版系统，让更多的人能够使用它，同时也介绍一些简单、强大的工具，希望能够降低一下初学者的入门门槛，不要在感受到Tex的魅力之前就被它吓倒。 Tex的简单历史和现状Tex是由计算机专家Knuth（中文名高德纳）在80年代创造的，Knuth是以为编程大牛，他在写作的巨作《计算机编程艺术》第二卷的过程中发现当时使用的计算机排版系统实在是丑陋不堪，大牛就是大牛，不忍他的著作被糟糕的排版污染，就发挥自己的特长，花费了近十年的时间从头创造了一个新的排版系统，并将其命名为Tex，是希腊语艺术和技术两词的词头，同时创造的还有字体处理程序Metafont。大家可能已经猜到了，Tex其实是一门编程语言，只不过他的任务是进行排版。Tex作为一门编程语言，天生具有强大的功能性、拓展性和可移植性。但是最初的Tex实在是太复杂了，需要记忆数百个格式处理命令，即使是专家用起来也不轻松。后来一个名字以La开头的数学系博士在Tex的基础将格式和内容文件分离，形成了现在广为使用的Latex系统。现在的Latex最新版本是Latex2e。对于我们中国的使用者来说，如果你直接去用原版的Latex的话，并不是一件轻松的事，应为要让Tex支持中文需要复杂的设置。幸好，已经有前人帮我们做好了功课。现在大部分中国Latex使用者使用的是已经配置好的CTex套装。这一套装已经集成了Tex系统、编译器、绝大多数宏包、pdf阅读器等一系列工具，到手即用，非常方便，大家可以搜索下载。 Tex学习资源推荐Tex是一个非常复杂的系统，然而大部分人不需要用到它的全部功能，只需要用到一小部分即可。国内有一些非常热心人致力于Tex的普及工作，下面是一些常用的资源： Latex Studio：http://www.latexstudio.net/ 国内最为活跃和全面的Latex综合站点，提供Latex教程、资源、模板等等。 《Latex2e完全学习手册》非常全面的中文入门教程，覆盖了Latex的方方面面，对于一般的使用者来说已经足够。 如果你觉得上面的学习手册篇幅太长，或者你已经有一定的Latex基础，可以看看K.L Wu 所写的《简单粗暴Latex》，这本书的latex源码作者也共享出来了，可以到此地址下载：https://github.com/wklchris/Note-by-LaTeX/tree/master/LaTeX-cn Latex的重要性Latex的学习曲线是十分陡峭的，理论上，你可以直接将一些模板拿来使用，改改文字就行了。但是，实际上，你总会遇到各种各样的问题。对于很多人来说，碰到一个Error，却有找不到错误所在的感觉是十分令人抓狂的。而且，一旦你不满足与现成的模板，想对格式做一些针对性的修改，往往有一些无所适从。你必须去检索、查阅大量的资料。这些特点注定了Latex的小众。那么我们为什么还要学习Latex呢？回想起当初走进Latex这个大坑的缘由，吸引我努力学习Latex的第一个理由就是对完美排版的追求。有过完整的Latex使用体验的人大多会被它排版的精致和美观所感动。和同样内容的Word文档对比，这种精致感是显而易见的，就像看到花了几百大洋买的精装书一样由衷发自内心的愉悦感。当你一旦知道了有很好的排版方式存在，就越来越不能忍受那些粗糙而低劣的效果。尤其对于数学公式而言，没有其他任何工具可以提供和Latex一样的效果。另一个理由就是Latex可以避免重复劳动。我十分讨厌Word上一遍遍的鼠标点击、拖选、再点击，就是为了把某些段落改个格式。除了时间上的浪费，损害最大的其实是写作时的心情。而Latex的哲学是格式和内容的分离。无论多少内容、无论分布于文档的何处，都可以通过一两个命令一次性完成调整。就像学习其他知识一样，一旦你掌握了某个技巧，你可以永远享受它带来的好处。一旦你学会了某个Latex命令，你以后再也不需要花时间去学它了。还有一个理由，是Latex对特殊格式的处理能力。比如说，生物领域的学者往往需要排版大段的DNA序列，用Word来处理会非常头疼。而通过自定义Latex命令，你可以实现下面的效果。又或者你需要插入外文、音阶之类的特殊符号，在Word环境下，你需要非常费力的去找、然而插入进去，但是插入的特殊符号往往与其他文字格格不入。Latex可以通过调入宏包的方式很方便的实现。 Latex绘图——Tikz 和 pstricksLatex的绘图曾经是一个麻烦的问题。当然，你可以用其他工具将图片画好之后直接插入进来，但是，那样的话图片的清晰度、图片与文本之间的协调型必然会大打折扣。对于已经进了Latex大坑的完美主义者肯定是不能容忍的事。所以有人搞出了tikz和pstricks。它们是Latex的宏包，通过程序语言能够直接绘制出各种复杂精美的图形。原则上，如果你是个编程控的，你可以精确的定义图形上每一个数据点、坐标轴、图形的坐标、大小、位置、样式。然而，大部分普通用户往往会被大段的程序吓到，不信的话可以去http://www.texample.net/tikz/ 上感受一下。这里我就不介绍tikz的具体语法和使用了（毕竟我自己也不会，如果你想学的话，可以去看看这个：http://blog.sina.com.cn/s/blog_01ea59580100urwi.html ）。这里我介绍一个图形界面工具，帮助大家用更简单的方法画出美观的图形。 Matlab2Tikz对于工程技术类工作者来说，Matlab是一个常用工具。Matlab输出的函数图表可以通过非常简单的方法输出为Tikz图表，直接插入到Latex文件中。这样，你既可以利用Matlab强大的数据处理和绘图功能，又能利用Tikz的绘图、排版功能，在文本中插入风格一致、可编辑的矢量位图。经过latex输出的图片在精细度、美观度上都比Matlab的原图有所提升。这个程序在数学建模之类的比赛中非常有用，能够在保证效率的前提下大大提高输出文件的美观度。事实上，除了Matlab，Mathematica软件的数据也可以通过简单的处理导入Tikz来绘制，详情可见http://bbs.ctex.org/forum.php?mod=viewthread&amp;tid=40700&amp;highlight= 。 GeoGebra初见GeoGebra的时候，以为它只是一个其貌不扬的小工具。然而简单使用一番之后，却发现它的功能真是出乎意料的强大。 一方面，GeoGebra 是一个动态的几何软件。你可以在上面画点、向量、线段、直线、多边形、圆锥曲线，甚至是函数，事后你还可以改变它们的属性。另一方面，你也可以直接输入方程和点坐标来绘制图形。GeoGebra 也有处理变数的能力（这些变数可以是一个数字、角度、向量或点坐标），它也可以对函数作微分与积分，找出方程的根或计算函数的极大极小值。总的来说，GeoGebra是一个面向中学数学教育的功能全面的综合数学平台。之所以在介绍Latex的这篇文章里介绍这个软件，是因为它可以方便的将绘制的各种平面函数图形直接导出为Tikz格式的latex文件。对于中学数学老师来说，出试卷方便了很多啊（不要打我）。初步感觉，Geogebra真的是一个很强大的软件，但是知名度很低。我自己也没怎么用过，无法过多评价，希望大家多多挖掘它的潜力。 ##DiaDia是一个简单好用的小工具。它主要是用来画各种流程图、UML图。同样支持直接导出为Tikz格式。相比于现在各种各样的流程图软件来说，Dia体积小巧、界面简洁、功能强大，是个不错的选择。 ##InkscapeInkscape是一个类似于Adobe illustrator的矢量绘图软件。免费、小巧，功能同样强大。Inkscape可以将绘制的矢量图导出为Latex支持的格式。 ##TikzEdtTikzedt是一个专门用来绘制Tikz图形的软件，它支持Tikz图形的实时编译预览，内置了很多命令，大大降低了Tikz的使用门槛。 好工具的意义不在它自身很多人会问这样一个问题：Word已经够用了，我为什么要学Latex？我自己也问过自己同样的问题。其实这个问题的答案很简单：如果你觉得Word已经够用的话，你不需要去学Latex。就像天天用电脑的人也没必要去学怎么造计算机一样。这篇文章标题的前半部分已经强调了，这是一个科研神器，它更适用于理工科技术类人员。尤其适用于能够自己产出知识的那一部分。就像望子成龙的父母一样，每一个研究出新想法、新理论的人都希望给自己辛苦计算出的公式、图形、文字一个好的外表，在他们看来，学习Latex的成本远远不及量子力学，而因为糟糕的排版使得其他人不愿意认真阅读背后的内容所带来的损失无疑大得多。同时，好工具的意义并不在于工具本身。优秀的工具能够让你重新去思考你所做的事。学习Latex的过程能够重新审视写作和排版的内涵，让你掌握一个更为优秀的工作理念。正如知乎上这个问题所问的一样：如何做到像使用 LaTeX 那样优雅地使用 Word？。即使你放弃了Latex，重新用起了Word，它依然发挥了它的价值。","categories":[],"tags":[]},{"title":"","slug":"科学研究的过去、现在和将来","date":"2018-01-13T08:27:04.671Z","updated":"2018-01-13T08:26:52.000Z","comments":true,"path":"2018/01/13/科学研究的过去、现在和将来/","link":"","permalink":"https://jerrynju.github.io/2018/01/13/科学研究的过去、现在和将来/","excerpt":"","text":"常听人说，中国人没有科学精神，理由是中华上下五千年文明历史，封建时代长期维持着世界第一的经济总量，但是却没有孕育出现代科学。最近，知乎上看到类似的问题，认真阅读了一些回答，发现了对这个问题的不同视角，在此做一些记录和思考。 讨论过去的科学研究是十分困难的，因为我们现在谈到的科学研究基本指的就是西方科学。算起来西方科学大规模传入中国不过百年，我们中国学生对它的了解基本都来自自己人的加工、演绎，甚至主要来自小时候看到的科普小读物、或者中学课本、课外书上的科学家小故事。这样的来源当然是不甚靠谱，给我们预设了根基薄弱的“第一印象”。一个典型的例子就是，西方长期的宗教历史和科学的产生是对立的吗？我们从小就听过中世纪黑暗的基督教迫害科学家，火烧布鲁诺，压制哥白尼的日心说等等黑历史层出不穷。然而一个有趣的现象是，提出遗传因子假说的孟德尔是个神父，近代物理学始祖牛顿晚年十分热衷神学，剑桥、牛津之类的牛校最初也是教会相关的人士出资修建。可见，宗教对科研并不仅仅只有阻碍作用。 科研如何产生？那么科学最初如何兴起呢？我不是专业的研究者，也没有时间去一一查找求证各种史料，只能凭据自己有限的阅历做一些合理的“想象”。从唯物的角度出发，思想的“上层建筑”来源于“经济基础”，科学来自于问题的发现、提出、探究和解决，而这每一个过程无不需要时间成本、经济成本。而且这些成本不仅限于解决某一具体问题的实际支出，还包括容忍失败所需的容错成本。这些成本是巨大的，无论在哪个时代、哪个国家都是如此。这一特点决定了科研作为一个整体，和其他高级精神活动一样，是一个社会统治阶级意志的体现。从这一点出发，中国没有孕育出现代科学就可以理解了。简而言之，在特定的历史时期，对于当时的统治阶级来说，科研的作用可以被完全替代。即使对于社会的其他阶级，科研仍有无法替代的价值，但是由于只有统治阶级可以负担科研的巨大成本，而他们却没有对科研的需求，因而没有产生科研的土壤。 科研的作用和替代品正如之前提到的，宗教孕育了早期的科研。其实宗教之于当时的社会就像科研对于当今的社会一样，正式因为他们对于社会相近的作用而产生了强烈的竞争关系，以至于在更替阶段发生了激烈的冲突。那么，科研的作用是什么呢？我觉得主要有两方面：一，它是最强大的生产力工具；二，它是统治阶级维持其统治地位的“底牌”——对疑问的终极解释权。科研作为生产力工具可以理解，那么它的“爸爸”宗教为什么曾经也是生产力工具呢？人们觉得宗教整天强调一些鬼神之事，对于实际的生产制造并没有多少帮助。我觉得并非如此。在生产力低下的阶段，最重要的生产设备并不是什么机械装置，而是数量最多、灵活性最大、能效比最高的“人”。这一设备最大的缺点是并没有直接稳定的控制手段，并不能一插上电源就能工作。他会忧虑生老病死、爱恨情仇之事，他会思考为什么工作，而宗教提供了一个有效的渠道来最小化这些意外因素对于人发挥其作用产生影响。而另外一个方面，宗教为统治阶级提供问题的终极解释权，就更好理解了。我们看到，西方数百年间换了多少王朝，统治的宗教却没有更换几个。中国也是，佛教一直延续了数千年。为什么统治阶级如此需要这些宗教，是因为它们在那个时代提供了其他东西提供不了的。它可以为众多根本问题提供最终回答。即使是君主的权利也需要宗教来提供解释。 科研的双重属性当代社会的科研活动已经自成体系，然而这一体系形成的时间其实并不长，尤其在中国这样的新兴科研大国。这一体系中存在着非常多奇怪的现象，科研体系中的人肯定有诸多体会，我不想赘述了。在思考这一现象背后的原因的时候，我有一些自己的理论。我觉得，当今的科研体系可以划分为两个部分：正向反馈部分和负向反馈部分。所谓正向反馈，就是系统加强已经发生的变化，使之进一步强化。而负向反馈就是系统压制改变，努力使之回复原状。正向反馈的目的是求新、求变，负向反馈的目的是稳定、完善。","categories":[],"tags":[]},{"title":"","slug":"普通人的知识管理和软件应用技巧","date":"2018-01-13T08:27:04.657Z","updated":"2018-01-13T08:26:52.000Z","comments":true,"path":"2018/01/13/普通人的知识管理和软件应用技巧/","link":"","permalink":"https://jerrynju.github.io/2018/01/13/普通人的知识管理和软件应用技巧/","excerpt":"","text":"###一、前言——我们为什么需要工具？ 古人云：“工欲善其事，必先利其器”。 我们的日常工作生活越来越离不开电脑和网络，计算机和互联网在方便和丰富我们的学习工作的同时，也给我们带来了海量的信息。这个时候，优秀的工具能够很好地提高我们的工作效率，避免重复劳动。 工具本身是一个十分宽泛的概念，汽车、自行车之类的交通工具，钢琴、小提琴之类的乐器都可以说是一种工具，然而并不是人人都有车开，也不是人人都有资源学会弹钢琴，唯有软件对所有人是平等的，你只要有电脑就可以使用它们，尤其在版权意识相对薄弱的中国。因此我们应该珍视互联网带给我们的机会，有意识地学习和利用优秀的工具来方便我们的工作和生活。 作为一位科研搬砖工工作者，我们大量的工作时间花在了电脑面前。找文献、看文献、做报告。。。现在的科研工作也早已进入了网络时代，已经不仅仅是智力和创造力的较量，还是精力和效率的比拼。 笔者一直对新鲜的科技怀有浓厚兴趣，在搬砖之余喜欢了解各种新鲜科技、探索各种新颖软硬件产品。了解的多了以后发现一些软件确实非常优秀，有一种相见恨晚的感觉，但是身边的同学知道的都很少，刚不要说使用了，因而产生了写一篇文章分享给大家的想法。优秀的工具浩如烟海，为了让文章更有条理，这里我借用善用佳软的分类，将一共13款优秀的软件介绍给大家。 ###二、系统工具操作系统是最为基础的电脑软件，系统工具的目的是完善操作系统的部分功能，弥补当今最通用的Windows系统的一些缺点。由于本人从未用过Mac，所以这里的软件都是Win平台下的软件。这里介绍的几个软件的主要功能如下： Listary：强化系统的文件检索能力，让你能够以最快的速度找到自己电脑中的文件； Lastpass：提供统一的密码管理服务，在保证安全的同时让密码不再成为阻碍； MacType：增强Windows的字体渲染能力，让电脑上的字体更为清晰易读； Phraseexpress： 增强系统剪贴板的功能，利用文字自动识别和输入功能简化操作； ####1. Listary——全能入口 下载地址：Listary 核心功能一览 无论在系统中的任何位置，都能够极快地搜索到电脑中的任何文件； 在输入的同时实时展现搜索结果； 对搜索到的文件直接进行常用操作，无需打开文件夹； 在Windows的打开文件对话框中提供更快更全面的搜索功能； 如果你是一个追求效率的人，你一定对Windows系统的资源管理器和文件打开对话框有所不满。不管我们用什么软件，打开一个文件总是离不开Windows的查找对话框的（就是下图中的那种）。它令人不快的地方在哪里呢？基本上你每次看见它，接下来总是免不了一番思索，我要打开的文件在哪里呢？然后是一番点击，打开一个又一个文件夹，点错了以后返回，记性运气不好的话，一两分钟的时间是免不了了。而Listary绝对是能够解救你的一款神器。自从我用上了它，就再也离不开。下面我来说说它到底神在哪里？ #####即时搜索用过Google的都知道，Google可以在搜索框输入的同时实时显示搜索建议和结果，Listary也有这一强大功能。当你想打开一个文件，却只记得文件名开头几个字母的时候，你只需要变输入边看显示出来的结果，Listary就可以实时的显示出来相关的结果，大多数时候，里面就有你想要的。 #####超快全盘搜索Windows资源管理器自带的搜索功能可能比树懒快不了多少，而且只能搜索当前目录。如果你有一个文件搁置在电脑的某个角落，要找到它可不是一件容易的事。Listary可以让这一切变得简洁快速。任意窗口下，按下快捷键，即可呼出Listary搜索框。输入文件名，即可搜索当前目录下的文件，如果想搜索其他位置，前面加一个“>”，就可以搜索电脑中所有位置，结果几乎立刻出现。带来的效率提升不言而喻。 #####文件查找对话框增强安装了Listary以后，无论你在什么软件中打开文件查找对话框，在对话框的下面会跟着一个Listary对话框。你可以直接在这个对话框中输入你想找的文件名，享受Listary带来的即时搜索、全盘查找、历史记录等一系列优秀特性，找到文件后按下Enter，对话框将立即定位到文件所在位置。如果有一个已经打开的文件管理器，当你复制地址栏的地址以后，无需任何操作，Listary会自动帮你定位到相应位置。可以说，有了Listary的帮助，文件查找才真正具有它本来应有的高效。 #####其他增强特性Listary还有其他特性，比如自动记忆搜索历史，将使用频率最高的文件排在前面；对搜索到的任意文件按下右方向键，即可进行一系列操作，比如打开所在文件夹、复制、剪切等等。可以说，围绕着文件搜索这个痛点，Listary已经做到了极致。为了你自己宝贵的时间，我建议读者认真学习一下这个软件。 ####2. Lastpass——网络通行证 下载地址：LastPass 核心功能一览 统一管理所有网站密码 网站自动登录 自动生成并记忆复杂的随机密码 全平台同步 Lastpass是最为知名、最为流行的密码管理软件，以密码管理为核心提供了一系列功能，能够大大简化密码相关的操作。从此设密码和输密码不再是烦恼。 #####统一管理密码安装了浏览器插件之后，Lastpass能够自动记忆你登录过的所有网站的密码，即使你在同一网站有不同的账号，也能全都记录下来。它还提供分析功能，检测你的密码是否被泄露，找出你的密码库中具有相同密码的网站，部分网站可以帮助你一键修改密码，账户的安全性能够得到很大提高。 #####自动登录账号当我们打开一个网站的时候，在通常的用户名和密码框的右侧会多出来一个Lastpass的图标，上面的数字显示的是你在这个网站的账户数目，选择账户之后，它就能自动帮你填写用户名和密码，一键登录。这样，切换马甲就变得极为方便。如果你在某个网站只有唯一的账号，在打开登录页面的同时，Lastpass就能自动帮你填写并提交，直接跳转到登录后的页面，不需要在登录网站上浪费时间，大大方便了操作。 #####自动生成密码Lastpass的密码自动生成功能，让你可以根据网站的要求，自由选择密码长度和组合方式，自动帮你生成符合要求的密码，并且同时储存进密码库中，完全不需要你记录下来。这样在你需要注册一些不常用网站的账号的时候，就完全不需要担心密码被泄露。 ####3. MacType——给电脑轻施粉黛 下载地址：MacType - 美化 Windows 字体的神器！ Mactype是个啥？用过苹果Mac OS的都有一个感觉，就是Mac上的字体比Windows清晰美观了不少。除了高分屏的影响外，这个和系统所用的字体渲染引擎有关。经过渲染的字体会显得更清晰、厚重、美观。Mactype的作用就是按照不同的方案对Windows上的字体进行渲染。话不多说，看下面这张图就行了。这个软件属于“一用就回不去”系列，一旦你习惯了更美观的字体，你就再也忍受不了Windows原生的丑陋效果了。使用时推荐选择注册表加载方式，可以避免很多兼容性问题。 ####4. Phraseexpress——凡人的办公利器 官网：Phrasexpress； 中文版软件和教程：凡人办公利器,唯有[片语快递] 核心功能一览 记录剪贴板历史 在任意窗口输入文本的时候，一旦检测到特定按键组合即可自动拓展为指定文字 提供宏记录功能，通过快捷键自动完成预先设置的操作 一键输入带格式的文本和表格 Phraseexpress，中文翻译“片语速递”，是一款源于德国的软件，知道的人可能非常少，但是它提供的功能很实用。操作自动化方面，AutoHotKey是最为知名和强大的软件之一，但是AutoHotKey的使用需要一定的编程基础，加之各种兼容性问题，门槛颇高。而Phraseexpress在能够实现绝大部分AutohotKey常用功能的同时，具有简洁美观的设置界面，通过傻瓜式的设置就能够实现很多功能，因而更为实用。 #####剪贴板历史记录“Ctrl+C”，“Ctrl+V”，大家都不陌生。却少有人关心这两快捷键幕后的功臣剪贴板。当你“Ctrl+C”以后，内容会被存储到剪贴板上，然而一般情况下，在你黏贴出来之前，你是看不到的。更令人烦恼的是，一旦你复制了新的内容，之前复制的就会被覆盖，想要重新复制，你得找到原来的地方，再“Ctrl+C”一次。Phraseexpress能够让剪贴板变得前所未有的强大。它能够自动记录剪贴板的所有历史，当你需要使用之前复制过的信息时，点击Phraseexpress的托盘图标，选择相应条目，就可以重新复制进剪贴板中，再次利用。它还有搜索功能，可以搜索剪贴板历史记录中的内容。 #####功能强大的自动化操作Phraseexpress的强大之处在于它围绕文本相关的内容提供了一系列的自动化操作，而且设置起来非常简单。我们经常需要输入一些重复的文本，比如网站登录时输入邮箱作为账号，邮件末尾输入落款，写论文时输入一长串专业名词，填表时输入手机号作为联系方式等等。当你把这些常用信息作为“片语”储存在Phraseexpress中之后，指定识别词或者快捷键，只要在文本框中输入了识别词，按下空格键，识别词就能够自动替换为预设文本。你还可以给预设文本设置好格式，直接在Word、Excel中插入带格式的文本或者表格，也可以将不同的文本设置为统一识别词，输入后会弹出窗口让你选择。也可以在要扩充的文本中预留姓名、日期等内容，在自动输入时，Phraseexpress会弹出窗口，让你根据具体情况填写。只要经过恰当的设置，Phraseexpress无疑能够大大的减少我们的重复劳动。Phraseexpress不仅仅服务于文本相关操作，它实际上是一款功能完善的自动化软件，它能够实现的功能主要受限于你的想象力。比如，你可以将它作为一个各个窗口都能使用的拼写检查软件，导入常用词库之后，它就能够自动帮你修正文字错误。你也可以将快捷键和识别词与打开网页、打开程序等一系列操作绑定，如果需要打开某个程序，即使没有输入框，在键盘上按下相应字母之后，也能够自动打开软件。甚至，它还提供自动数学计算功能，在输入文本的同时，如果需要计算，直接输入数字，按下快捷键，它能够自动用计算结果替换输入的数字，这样就完全不需要再另外打开计算器了。Phraseexpress是一款简洁、强大的软件，它提供便携版，无需安装，直接使用。正如标题所言，它是凡人的办公利器。 ####其他优秀系统工具推荐优秀的系统工具有很多，无法一一介绍，下面几款是笔者非常喜欢的小软件，平时经常用到，大家可以尝试一下。 Rolan：小巧的快速启动工具，以标签页形式存放应用快捷方式； 1Clipboard：专注于剪贴板增强，界面美观； PicPick：最强大的截图软件，提供极为丰富的功能，界面十分美观； ###三、文件管理文件是计算机中最主要的信息载体，每个人的电脑中都有着海量的文件，各种格式、各种来源、各种用途，我们在管理和使用这些文件上花费了大量时间和精力，有一些软件为了更好地管理这些文件而生，如果能够利用它们，我们的效率将会大大提高。 Directory Opus：系统文件管理器的绝佳替代品，具有丰富的功能和强大的可定制性。 ReadCube：新颖而强大的文献管理器，一站式解决文献管理问题。 ####1. Directory Opus——终极文件管理器Windows的文件管理器是我们每天打开电脑用的最多的程序之一，几乎任何和文件相关的操作都离不开它。它虽然能够基本满足我们的日常需求，但是很多设置却不尽完美，是我们提高电脑操作效率的主要绊脚石。而我要介绍的Directory Opus（以下简称DOpus）是一款极其强大的文件管理器，功能覆盖非常全面，甚至可以说只有你想不到的功能，没有它做不到的功能。与此同时，它的可定制性非常高，可以任意定制界面、快捷键、菜单等等。下面我参考子清的文章，对这款软件的核心特色做一个简单介绍。 #####极具灵活性的文件视图传统的Windows资源管理器只有一种展现形式，而DOpus突破了这种限制，有多种列表窗模式，你可以任意选择文件窗、文件树、缩略图等等窗口的显示数目和排列方向，以满足不同的需求。 #####通过标签页快速切换文件夹大家都使用过浏览器或者WPS上的多标签页功能，多标签的优势是显而易见的，一是直观：多个文件夹在一个窗口就可以显示；二是方便：拖放文件，复制文件，从一个窗口到另一个窗口的转移特别方便。 #####快速过滤、分类、分组和查询文件夹DOpus的“文件夹选项”中带有“名称过滤器”功能，选择后会在状态栏有一个过滤器条出现，归类出多种格式的文件。选择其中的一项，比如“.pdf”，那么所有带有“.pdf”后缀的文件都会列出来，而其余的文件都会被暂时隐藏。也可以选择只显示文件或文件夹，这样就能够快速的看到自己关心的文件类型。 #####集成的FTP和压缩文件功能DOpus集成了FTP功能，打开FTP链接后，FTP网络端就像一个普通文件夹一样在DO的窗口下展现，编辑相当方便。压缩文件可以在窗口中直接打开并管理，不需要安装WinRAR和WinZIP之类的软件就可以完成对压缩文件的处理。Zip, 7Zip, RAR以及很多其他的压缩格式都支持。 #####强大的查看器窗格不需要安装专门的图片浏览器，就可以直接在DOpus的查看器窗格里预览图片。除了图片，Word, Excel和PPT的内容也可以即点即看，不需要打开文件。不需要安装暴风影音之类的视频播放器，也可以直接浏览.avi视频文件。一些不太常见的文件格式，比如.bat也能直接预览 #####高级批量重命名功能DOpus对文件管理中经常用到的新建文件夹、重命名、复制、黏贴都进行了大幅优化，功能性提高了不止一个数量级。比如批量重命名功能，如果我们想将一个文件夹中名称杂乱无章的图片重命名为统一格式，就可以用到DOpus的批量重命名功能。选中文件后，进入重命名菜单，你会发现有若干模式，其中最重要的莫过于正则表达式。正则表达式可以实现用一些统一格式的字符格式来批量重命名，比如，用“作者”+“上次保存日期”，那么每个文件都会命名为这种格式。这里，作为示范，我们用“上级文件名”来对文件进行编号，步骤如下图。设置完毕后，点击“确定”，文件已经按照我们的要求命名好了。 #####其他高级功能DOpus功能非常多，无法在此一一介绍。其他主要的功能包括，文件夹同步和重复文件查找、文件复制排队、输出文件夹文件列表、文件颜色标注和评分等等，足以覆盖用户的需求。 ####2. ReadCube——梦幻般的文献管理器 Readcube是近乎完美的文献管理器，如果没有墙而你又是付费用户的话，它会更完美。 下载地址：https://www.readcube.com/home?r_c=YH1En 文献管理器是阅读和管理文献的核心，因而选择一款好用的文献管理器十分重要。目前主流的选择包括ReadCube, Mendeley和Endnote。根据笔者自己的实际使用体验，这几种文献管理软件中最好的是Readcube。无论从美观程度、功能性、平台覆盖面上都有碾压其他软件的势头，缺点是略微有点卡顿。下面我来具体介绍一下它的主要功能和特色。 #####Enhanced PDF——PDF文件自动识别和强化目前几乎所有的文献都是以PDF格式存在，对PDF文件的处理方式和识别能力直接决定了一款文献管理软件的好坏，而ReadCube的杀手锏正是PDF自动识别。 当我们从期刊网站或者课题组主页上下载了某篇文件的PDF文件之后，通过Readcube的导入按钮，将文献拖动到Readcube界面或者直接定位到文献所在文件夹，就可以将PDF文件批量导入Readcube。一旦导入，Readcube就会自动识别文献的具体信息。识别成功的文献会在软件界面右侧显示文献的信息，包括期刊、编号、标题、作者、摘要等等。甚至会显示该文献的引用量。这样，你的文献就不再只是以PDF文件的形式存在，而是以信息完备，分类详细的数据库的形式存在。管理将更为方便。你还可以选择将数据库中的文献自动按照作者、发表时间或者标题进行重命名，重新保存到指定文件夹中。点击阅读按钮，我们可以打开增强后的PDF文件。文献中的所有作者姓名和参考文献的引用上标都变成了可以点击的状态，点击之后，可以直接跳转到该引用文献的下载界面或者作者主页。而右侧的一系列选项卡除了提供了参考文献列表以外，还提供了很多非常有用的功能。比如Metrics选项卡，以图表形式给出了该文献的引用数随时间的变化。下方给出了具体的引用文献，直接点击就可以下载。它甚至还能给出其他引用文献引用该文献时的具体描述。这一功能简直是科研工作者做梦都想要的功能。当我们找到一篇我们感兴趣的重要文献时，只需要结合ReadCube提供的引用和被引用文献列表，就能够非常迅速的勾勒出一个文献网络，一旦在这个网络中发现其他感兴趣的文献，只需要一次点击（在你的学校购买了相关数据库的情况下），ReadCube就能够自动帮你从学校代理连接到期刊网站，甚至能自动帮你下载好，放入你的数据库。理想情况下，全程不需要任何额外操作。文献查找和下载的效率得到了极大的提升。Files选项卡给出了PDF文件在电脑中储存的位置，更重要的是，如果该文献有Supporting Information，即使你没有下载，Readcube也能够在这个选项卡中显示，点击后就可以直接下载。而Cite选项卡则让你能够导出文献各种格式的引用，方便在Word、PPT等软件中插入。 #####Recommendations——推荐功能Readcube另一个核心功能是自动化推荐，它能够根据你文件库中已有的文献自动计算出你感兴趣的文献，推荐给你，同样只需要简单点击就可以下载。而且它可以根据你导入文献时创建的文件夹，针对性地推荐某一特定类别和特定时间段的文献给你。这样你就不需要费时费力地到网上检索了。 #####All Platforms——全平台特性相对于其他文献管理软件，Readcube的全平台同步特性非常强大。它几乎覆盖所有平台，包括Web、PC、Mac、iPad、Android等等。而且在各个平台上，Readcube的使用体验几乎一致，功能性并没有损失。在网页版上，Readcube还能够自动列出文献中的图片和图片标注，方便在阅读文献时定位到提及的图片。 #####Readcube Web Importor——Chrome插件Readcube Web Importor是Readcube新出的Chrome插件，付费用户才能使用。通常，文献需要将PDF文件下载下来，再导入软件中才能够进行管理，这个插件通过在浏览器中提供入口，将这一过程进一步简化。当你打开Google Scholar或者Pubmed的时候，它会在页面中的每个搜索结果后面直接加上一个按钮，点击以后可以直接将结果加入Readcube数据库。而点击插件栏上的按钮，插件将自动识别搜索结果中的文献，你可以通过勾选你感兴趣的结果，将文献直接批量加入Readcube数据库中。这样，你连下载PDF的时间都省了。 #####关于付费功能Readcube的全平台同步和Metrics功能是需要购买按年付费的高级版的，高级版还提供一个付费功能是监控特定文件夹，有新文件后自动导入。新用户可以获得3个月高级版的免费试用，推荐十个人使用Readcube的话还可以获得一年高级版。Readcube高级版的正常价格是55美金一年，但是黑色星期五之类的促销季会打折。至于值不值，各位自己衡量啦。 ###四、思维管理思维管理的目的是将我们所思所想清晰、有条理地展现出来，让受众能够很快明白我们需要表达的观点。笔者使用的方式主要是PPT和思维导图。 Powerpoint：最常用的办公软件之一，通过安装两个强大的插件，可以让它的功能更全面。 Mindmanager：经典思维导图软件，功能全面、界面美观、全平台同步。 ####1. Powerpoint——挖掘新潜能 Powerpoint大家都很熟悉，这里想介绍的并非Powerpoint本身，而是两个增强插件： Nordri Tools和OneKey Tools。它们两个各有侧重，一起使用可以极大地提高PPT软件的潜力。 #####Nordri Tools 获取地址：Nordri Tools Nordri Tools安装后，PPT的工具条上会多一个选项卡。可以开到，它的功能主要是对已有PPT功能的增强和组合。我们看对齐选项卡，打开后，桌面上会多出一个独立于PPT软件的工具条，里面整合了多个功能，包括对齐、调整大小，排列，组合。这些功能整合到一起，并且具有独立按钮，我们就不需要再到原来的选项卡里多次点击和寻找了。你可以通过点击“等大小”按钮，让两个图片具有完全相等的长、宽，处理大量图片的时候非常有用。而色彩库功能，能够联网查找多种配色方案，一键应用到所有幻灯片上，这样你就不用再受PPT自带方案的束缚了。除了一些工具之外，它还提供了一些PPT相关的知名网站、博客，你可以在这个上面找到丰富的资源、教程和素材，不用再费心费力地百度了。 #####OneKey Tools 获取地址：OneKey Tools 和Nordri Tools不同，OneKey提供的功能就多得多。它像一个武器库，里面各种你想不到的功能都有。它自带精心准备的图文教程，所以我就不在这里画蛇添足了，我就转载一些例子，让大家对它的能力有一些感受。这个例子将两个图片以类似半透明的方式结合到一起，产生了很强的艺术效果。这个例子字图片上加上了雪景作为背景，看似简单，实际上如果没有插件的帮助，很难实现。 OneKey的潜力很大，很多设计师用它实现了许多令人惊奇的效果，它的学习途径很完善，大家安装以后可以直接点击教程按钮学习。 ####2. MindManager——思维规划师 获取地址：MindManager 有很多能够绘制思维导图的软件，百度出品了一个百度脑图。这里要介绍的Mindmanager虽然是一个付费软件，但是它的功能最为全面，平台覆盖最广，如果你是一个思维导图的熟练用户，值得尝试一下。MindManager的界面非常接近我们熟悉的微软Office 2016，都是简洁清爽的扁平化风格，左侧边栏显示帮助和提示，右侧显示拓展选项卡，中间显示思维导图。它的帮助和提示非常全面、友好，便于思维导图新手入门。Mindmanager的右键浮动菜单和微软Office非常类似，提供了丰富的功能。既能进行文本方面的操作，也能够对思维导图的主题进行相关操作。右侧的选项卡提供了头脑风暴功能，可以在软件的提示下进行头脑风暴。任务选项卡可以设置任务的起止时间，Mindmanager能据此生成甘特图，完全可以当成Project的简化版使用。同步功能算是Mindmanager的核心特点。它提供独立的文件窗口管理不同客户端上的思维导图，可以分别设置权限。手机和Pad上都有移动版的Mindjet思维导图软件，功能同样十分全面，让你可以随时随地用思维导图记录自己的所思所想，整理思绪。 ###五、时间管理个人理解的时间管理包括两个方面，一个是通过各种工具来简化操作、节省时间；另一个方面是通过合理规划任务，达到时间利用最大化。这里介绍的WGestures和火狐阳光盒子定制版通过提供各种功能优化了我们平时花费时间最多的操作，能够节省大量时间。而奇妙清单是一款非常优秀的To-Do-List软件。 WGestures：为系统提供鼠标手势、触发角等功能，将最常用的操作尽可能简化。 Firefox阳光盒子定制版：通过丰富的功能集成，一站式解决网页浏览相关的所有可能操作。 奇妙清单： 功能丰富、简单易用的任务清单软件，带有协作和分享功能。 ####1. WGestures——鼠标效率最大化 获取地址：WGestures WGestures是一款给Windows系统带来全局鼠标手势功能的软件。用过浏览器上的鼠标手势插件的同学都能体会到鼠标手势的方便之处，而WGestures将鼠标手势功能带到了整个系统。你可以在桌面上，在文件管理器里，在任何一个软件里使用你自定义的鼠标手势，而且你可以为每个软件定义不同的手势组合。除了鼠标手势外，WGestures还有触发角功能，触发角的意思是，将鼠标指针移到电脑屏幕的四个角，无需任何点击，就相当于按下相应的快捷键。默认左上角和右上角用来切换程序，左下角打开开始菜单，右下角显示桌面。WGestures的官网上有清晰明了的视频介绍，这里不再赘述。 ####2. Firefox定制版——终极浏览器 获取地址：firefox-sunbox-plus 浏览器的世界高手如云，IE、Chrome、Firefox三足鼎立，还有360、UC、搜狗等一众国产小弟。浏览器各有各的好，我的评价标准主要是两个，功能丰富、外观精美。在尝试了众多浏览器之后，目前我最满意的是基于Firefox的阳光盒子定制版。它具有简洁美观的界面、异常强大的功能、超级丰富的可扩展性。我们可以先来看一个例子，下面两幅截图除了展示了浏览器自身的界面外，还展示了安装了自定义样式后的Google和Wikipedia页面。信息展示量和美观程度都有了极大提升。在第一张图中，由于该浏览器自带了三种翻墙插件，打开被墙网站时，可以自动切换到代理服务器，因而平时可以无缝打开Google、Youtube、Facebook等网站。同时通过浏览器中的Stylish样式管理器安装了“清爽谷歌”样式，可自动去除Google页面的广告，同时以双栏形式排版搜索结果，以更好地利用宽屏的优势。在安装了搜索辅助插件后，在Google中搜索某一关键词时，可以同时在Baidu、Sogou、Bing以及微博中搜索该关键词，默认显示其中除广告外的前三项，并以红色标注其中的关键词。自带的自动翻页插件可以让你无需点击下一页按钮，页面滑动到底部时自动加载下一页。如果需要的话还可以打开高亮功能，以不同颜色标注你搜索的各个单词，方便查看（比如第二张图里搜索Directory Opus时，分别以黄色标注Directory，以绿色标注Opus，这个标注在你点击了检索结果以后能够自动在新的页面标注搜索关键词）。通过这一个例子，我们就可以看出这个浏览器的诸多强大之处。 软件，尤其是浏览器，功能的强大与否离不开它的插件。而通过这个火狐定制版，我第一次意识到了扩展的威力。不仅仅是普通的插件，通过Stylish样式管理器、Greasemonkey脚本管理器以及整合的Fanqiang功能，让浏览器的功力成倍提升。虽然普通的浏览器也可以安装这些插件，但是由于整合的复杂性，要将它们调教到一个稳定可靠的状态并非易事，正因如此，我们才需要程序员大牛们的定制版。 #####首页阳光盒子的首页是它的第一大亮点。这个由软件作者自己制作的首页可以自动更换美观大气的壁纸，上方的搜索条集成了众多搜索引擎，百度云、贴吧、淘宝应有尽有。而中间是一个小型的导航页，这个导航页最大的特点是可以自定义，自定义的方式也十分简单，点击右上角编辑按钮，会打开一个文本文件，只要在灰色部分输入想要添加的网页名称和网址，保存之后，刷新页面，改动立刻生效，网站图标也会自动提取。这个页面是我见过的所有标签页里美观度、功能性和可定制性平衡的最好的一个。 #####右键菜单阳光盒子的右键菜单非常强大，集成了很多功能。而且根据你点击的对象不同，它会自动显示不同的功能。上图是我们右击一个带链接的图片时所显示的菜单。功能非常丰富，除了常用的以外，甚至还提供很少见的文字识别、迅雷云播等功能。 #####插件现在几乎所有的浏览器都能够安装大量插件，但是问题往往在于我们不知道哪些插件才是我们需要的。而阳光盒子自带了一些非常优秀的插件，让我们可以尝试，如果你不需要，可以点击按钮关闭或者删除。 #####样式样式是一个很有用的东西，就像前面提到的Google的例子一样，样式能够改变网页的显示方式，让页面显示的更紧凑、美观。 #####脚本脚本的作用是给浏览器带来更多小功能，比如音乐电台、导入导出、搜索框增强等等，能够进一步丰富浏览器的功能。 #####科学上网科学上网是一个门槛颇高的工作，很多简单好用的工具经不住越来越高的城墙阻挡，败下阵来。目前口碑颇高、成功率最大的三个工具，XX-net、ShadowSocks、Lantern，阳光盒子都集成了。可以自由切换。相信即使对于小白用户来说，科学上网也不再是个难题。 ####3. Wunderlist——待办事项管理 获取地址：奇妙清单 任务清单类的软件非常之多，奇妙清单算是其中的佼佼者。它外观简洁，功能全面。除了必不可少的全平台同步之外，下面几个功能颇有特色： 文件夹：可以用文件夹的方式对任务进行分类。 自动识别日期：当你输入的任务中有日期和时间时，Wunderlist能够自动识别出来，并加入自动提醒。 子任务列表功能：将较大的任务分解成可操作、可监控的子任务 注释：用来记录任务进度，工作心得或需要特别考虑的要点 邀请（Invite friend)：可以同他人分享某个任务列表，结合评论功能，小团队间完全可以进行简单的项目管理工作。 邮件发送：由于不是所有同事、朋友都在使用Wunderlist，当我需要分享某个列表或安排任务时，可以很方便的将列表或某个任务发送给对方。 ###六、知识管理信息在没有经过归纳、整理、思考之前只是一堆无用的数据。而笔记类应用现在也来越往知识管理软件的方向发展，其目的就是让信息在其中变成对用户真正有用的知识。 为知笔记：功能全面、操作友好的笔记类软件。完全有实力成为个人信息处理的核心应用。 Markdown：极为简单的程式化语言，让文字摆脱格式的束缚，与思想更近。 ####1. 为知笔记——全能信息中转站 获取地址：为知笔记 笔记类软件最知名的有Evernote、有道云笔记和为知笔记。这些软件笔者都使用过，那么为什么最后选择了为知笔记呢？主要是下面几点。 #####实时同步和无限空间实时同步可以说是笔记软件的基本功能，它的好处是毋庸置疑的。当你记笔记的时候完全不需要担心保存的问题，笔记软件会定时帮你同步到云端，离开电脑，打开手机，立马可以接着电脑客户端的内容继续写。很多笔记软件将存储空间作为盈利点之一，提供有限的空间，如果需要扩大，则需要进一步付费，而为知笔记只对用户每月的上传流量加以限制，每月500M，对于普通用户完全够用了，还是相当良心的。 #####多级文件夹和Markdown功能多级文件夹看似是一个简单的功能，然而很多笔记软件，比如Evernote的免费版并不提供，这一功能让我们可以任意新建可以互相嵌套的文件夹，让数量越来越多的笔记能够更有条理的组织起来。除了多级文件夹，为知笔记原生支持Markdown，这也是一个其他常用笔记软件没有顾及的功能，随着Markdown的逐渐流行，越来越多的人离不开它，因此，为知笔记对于喜欢使用Markdown的人来说，是最好的选择之一。 #####杀手锏——强大的信息搜集能力作为一款知识管理软件，资料搜集能力是评价其好坏的核心。而为知笔记前身为网文快捕，以网页信息搜集起家，这方便自然有一点先天优势。目前为知笔记已经覆盖了几乎所有平台，除了常见的三大操作系统、几大主流浏览器、ios、android之外，你甚至还可以通过微博、微信、邮件来搜集信息。可以说，无论你在互联网世界的那个角落里看到了有用的东西，都可以在几秒钟之内存放到为知笔记里。 #####应用中心——进阶用户的藏宝室为知笔记有自己的应用中心，里面有很多强大的工具。比如可以实时渲染的Markdown编辑器，自带全套Vim快捷键的编辑器，各种导入导出、格式转换插件，思维导图、图片管理、文字标注插件等等，让你不需要离开为知笔记，就可以方便的实现各种文字编辑工作。这篇文章就是安装了为知笔记应用中心中的Editor.md插件之后，用Markdown在为知笔记里撰写和编辑的。 #####一键发布到博客虽然现在写博客的人越来越少了，但是对于有此习惯的人来说，为知笔记提供了一个贴心的功能，它可以将编辑好格式的图文直接发布到博客。只需要在相应菜单中填写博客地址和账户即可。这样，信息的搜集、撰写和发布都可以在为知笔记中完成，为知笔记完全可以当做一个信息的处理中心。 ####2. Markdown——让文字摆脱Word的束缚前文笔者多次提及了Markdown，Markdown是一个简洁的文本标记语言，用于对文本快速进行格式化。 在这里你可以看到它的使用说明，非常简单，几分钟内就可以掌握它的基本语法。 我们为什么要学习使用Markdown呢？主要目的是让我们在电脑或网络上书写文字的时候能够专注于文字内容本身，而不是被各种格式设置所羁绊。Markdown可以通过在文本内容中输入一些简单的字符生成格式化的文本，形成各级标题、有序无序列表、粗体、斜体、下划线等等。不需要将键盘上敲字敲得正起劲的手挪到鼠标上，点击各种图标来设置格式。现在有很多软件和网站都已经支持Markdown语法。比如为知笔记、简书，你还可以通过在Chrome上安装Markdown Here插件，在网页文本框中直接将Markdown转化为html格式化语言，这样你在微信公众号编辑器和邮件里也可以使用Markdown了。 笔者最近发现了一个小众而强大的Markdown编辑器“小书匠”，不仅支持增强的Markdown语言，可以插入数学公式、脚注等等，还可以直接与各个笔记平台同步。界面美观，甚至提供了沉浸式的写作模式，令人爱不释手。希望大家去尝试一下。 ###七、后记 传授是最好的学习 本文的写作历时数月，文中的一些内容之前已在作者的其他文章中提到，这篇文章算是一个整合和收尾之作。对优秀工具的探索和学习给我带来了很多乐趣。这一段时间里，我时常会感慨：竟然有这样的软件？原来这个可以这么方便？除了软件本身带来的乐趣，在这个探索过程中我还漫游到了互联网世界诸多被遗忘的角落。其中接触最多的就是很多优秀的个人博客。在几年之前，那个RSS尚且流行、微博微信尚未崛起的时代，有很多人认真的写着个人博客，无私地分享自己的知识与经验。我只不过粗略地写过两三篇短小的文章，已感觉到写作和分享的不易，那些写过成百上千篇排版规整的博文的人实在是让人敬佩。 然而，那个时代已然渐行渐远了。 近日，偶然看到一人所写的记录他办AutohotKey论坛的历程，其中写道： 一串的域名： ahkbbs.cn，ahk.5d6d.com，cn.autohotkey.com，autohotkey.com每个都代表着随风逝去的大量心血，接下来又会是什么？ahk8.com 和 ahkscript.org 并非二选一，但 AutoHotkey 中文用户本身不多（指愿意上论坛的），我不愿意看到再次一分为二。 怎能不令人唏嘘。还有一次在一个论坛里看到一个人在所写教程里故意留了一个明显的错误，只要尝试过他所写步骤的人都能发现，然而数月过后，竟无一人提出。在这个泛娱乐化的社会，我们本不该评判别人什么，但是当优秀的软件基本来自国外，寻找教程只能搜到英文答案的时候，我们应该反思一下，我们能为这个大环境做些什么。虽然泛娱乐化的大潮如滔滔江水，改善的希望总是渺茫的。 尊敬创造者","categories":[],"tags":[]},{"title":"","slug":"高效率科研神器——驾驭文献洪流","date":"2018-01-13T08:27:04.513Z","updated":"2018-01-13T08:26:52.000Z","comments":true,"path":"2018/01/13/高效率科研神器——驾驭文献洪流/","link":"","permalink":"https://jerrynju.github.io/2018/01/13/高效率科研神器——驾驭文献洪流/","excerpt":"","text":"文献无疑是目前科研成果的最主要载体。在大家坚持不懈地灌水努力下，现在的文献是越来越多，大有涛涛江河汇成大海之势。然而，怎样才能在大海里畅游而不迷失方向？怎样才能在海里钓到大鱼呢？今天我就来介绍一下我个人的经验。 #1. Readcube——最好的文献管理器 Readcube是近乎完美的文献管理器，如果没有墙而你又是付费用户的话，它会更完美。 获取地址：https://www.readcube.com/home?r_c=YH1En 文献管理器是阅读和管理文献的核心，因而选择一款好用的文献管理器十分重要。目前主流的选择包括ReadCube, Mendeley和Endnote。根据笔者自己的实际使用体验，这几种文献管理软件中最好的是Readcube。无论从美观程度、功能性、平台覆盖面上都有碾压其他软件的势头，缺点是略微有点卡顿。下面我来具体介绍一下它的主要功能和特色。 #####Enhanced PDF——PDF文件自动识别和强化目前几乎所有的文献都是以PDF格式存在，对PDF文件的处理方式和识别能力直接决定了一款文献管理软件的好坏，而ReadCube的杀手锏正是PDF自动识别。 当我们从期刊网站或者课题组主页上下载了某篇文件的PDF文件之后，通过Readcube的导入按钮，将文献拖动到Readcube界面或者直接定位到文献所在文件夹，就可以将PDF文件批量导入Readcube。一旦导入，Readcube就会自动识别文献的具体信息。识别成功的文献会在软件界面右侧显示文献的信息，包括期刊、编号、标题、作者、摘要等等。甚至会显示该文献的引用量。这样，你的文献就不再只是以PDF文件的形式存在，而是以信息完备，分类详细的数据库的形式存在。管理将更为方便。你还可以选择将数据库中的文献自动按照作者、发表时间或者标题进行重命名，重新保存到指定文件夹中。 点击阅读按钮，我们可以打开增强后的PDF文件。文献中的所有作者姓名和参考文献的引用上标都变成了可以点击的状态，点击之后，可以直接跳转到该引用文献的下载界面或者作者主页。而右侧的一系列选项卡除了提供了参考文献列表以外，还提供了很多非常有用的功能。比如Metrics选项卡，以图表形式给出了该文献的引用数随时间的变化。下方给出了具体的引用文献，直接点击就可以下载。它甚至还能给出其他引用文献引用该文献时的具体描述。这一功能简直是科研工作者做梦都想要的功能。当我们找到一篇我们感兴趣的重要文献时，只需要结合ReadCube提供的引用和被引用文献列表，就能够非常迅速的勾勒出一个文献网络，一旦在这个网络中发现其他感兴趣的文献，只需要一次点击（在你的学校购买了相关数据库的情况下），ReadCube就能够自动帮你从学校代理连接到期刊网站，甚至能自动帮你下载好，放入你的数据库。理想情况下，全程不需要任何额外操作。文献查找和下载的效率得到了极大的提升。 Files选项卡给出了PDF文件在电脑中储存的位置，更重要的是，如果该文献有Supporting Information，即使你没有下载，Readcube也能够在这个选项卡中显示，点击后就可以直接下载。而Cite选项卡则让你能够导出文献各种格式的引用，方便在Word、PPT等软件中插入。 #####Recommendations——推荐功能Readcube另一个核心功能是自动化推荐，它能够根据你文件库中已有的文献自动计算出你感兴趣的文献，推荐给你，同样只需要简单点击就可以下载。而且它可以根据你导入文献时创建的文件夹，针对性地推荐某一特定类别和特定时间段的文献给你。这样你就不需要费时费力地到网上检索了。 #####All Platforms——全平台特性相对于其他文献管理软件，Readcube的全平台同步特性非常强大。它几乎覆盖所有平台，包括Web、PC、Mac、iPad、Android等等。而且在各个平台上，Readcube的使用体验几乎一致，功能性并没有损失。在网页版上，Readcube还能够自动列出文献中的图片和图片标注，方便在阅读文献时定位到提及的图片。 #####Readcube Web Importor——Chrome插件Readcube Web Importor是Readcube新出的Chrome插件，付费用户才能使用。通常，文献需要将PDF文件下载下来，再导入软件中才能够进行管理，这个插件通过在浏览器中提供入口，将这一过程进一步简化。当你打开Google Scholar或者Pubmed的时候，它会在页面中的每个搜索结果后面直接加上一个按钮，点击以后可以直接将结果加入Readcube数据库。而点击插件栏上的按钮，插件将自动识别搜索结果中的文献，你可以通过勾选你感兴趣的结果，将文献直接批量加入Readcube数据库中。这样，你连下载PDF的时间都省了。 #####关于付费功能Readcube的全平台同步和Metrics功能是需要购买按年付费的高级版的，高级版还提供一个付费功能是监控特定文件夹，有新文件后自动导入。新用户可以获得3个月高级版的免费试用，推荐十个人使用Readcube的话还可以获得一年高级版。Readcube高级版的正常价格是55美金一年，但是黑色星期五之类的促销季会打折。至于值不值，各位自己衡量啦。 #2. Google图片——进行直观的发散式搜索 很少有人会喜欢阅读满屏幕的英文，尤其当这些英文中还夹杂着很多字典也查不出来的专业词汇的时候。但是图片却不一样。优秀的学术文章大多会有简洁美观的示意图。通常情况下，看到这些图片，你就能够大致明白文献的主题。人脑的强大之处在于形象思维和抽象能力。通常情况下，人们更能够从满屏幕的图片而不是满屏幕的文字中发现相关信息。从这一点出发，我自创了一种快速查找文献的方法，那就是利用Google图片。Google图片搜索的优良算法能够很好的将相关或者近似领域的搜索结果显示到一起。而且针对单一图片，能够进一步展示类似图片。并且，相对于其他搜索引擎，我个人感觉，Google给予学术结果的权重更大。下面我们以Self-assembly为例，来看看怎么利用Google图片搜索学术资料。 我们可以看到搜索结果基本都是简洁明了的学术文献的示意图。大部分图片我们不需要看注释文字就可以大致猜出它要表示的内容。点击排在前面的一幅图片，这幅图片来自nature网站，图片标题下方给出了图片的文字描述，我们可以根据描述进一步理解图片表达的意思。而文字描述下方，Related images给出了类似的其他图片，我们不需要离开当前页面就可以进一步查看。而点击View More，我们就可以查找和当前图片相关的其他图片，注意，这时候新的搜索是以图片为基础，而不需要输入关键词，也就是说Google可以根据你感兴趣的图片自动帮你联想关键词。这样你就不要煞费脑汁的去思考用什么英文单词来搜索了。 这一系列看似简单的功能，实际上使得我们能够以一两个关键词为出发点，极其方便的构建一个庞大的搜索网络，而整个过程中，所有结果都是以图片形式呈现，你甚至不需要输入文字，只需要点击鼠标就行了。你所有的注意力只需要集中到对图片想要表达意思的抽象判断上。这无疑让查找文献的过程变得极为高效和简化。 #####相关插件搜索结果图片中，前面的一排方形文字是安装了Chrome谷歌搜索优化插件之后显示的关键词进一步精确化的建议，它能将原来网页搜索结果上方的搜索建议进一步细化，并且以更美观的形式呈现出来，同时以相同颜色表示相同类别的关键词，方便识别。 同时推荐安装Power Zoom图片放大插件，按下Ctrl键，鼠标移过图片的同时可显示该图片的全尺寸放大图。 #3. 文献订阅自从被Google抛弃之后，RSS订阅服务似乎渐趋没落，使用者越来越少。但是由于科研领域的特殊性，RSS在科研领域还是有它的用武之地，尤其是在文献推荐方面。这里，我介绍两个新颖的RSS文献推荐和订阅服务。 ###一览阅读——新时代的最佳RSS阅读器之一 作为一款本土应用，一览是一个令人欣慰的存在。它界面简洁美观，提供瀑布流式的浏览方式。而且它自带颇为丰富的订阅源，除了可以订阅专业学术期刊网站外，还可以订阅很多泛科学领域的知名网站，如知乎、果壳等。可以说是目前国内RSS阅读器最好的选择之一。 ###SciReader SciReader是专注于学术领域的免费文献个性化推荐服务。它的主页面提供三个基本功能，一个是根据你设置的关键词和兴趣领域推荐相关的最新文献给你，可以自动发送到你的邮箱，第二个是在tweeter上讨论最多的文献，第三个是来自Science Daily上的学术新闻。见面美观简洁，功能实用，是一个值得考虑的服务。 #4. 浏览器插件除了独立的网站和软件之外，有一些优秀的浏览器插件也能够给我们的学术生活带来很大便利。 ###Wiki2 or WikiwandWiki2 和 Wikiwand 都是维基百科美化和功能增强插件。维基百科是目前最为庞大的网络百科全书，储藏了海量的知识，但是界面却略显简陋。这两个插件的主要作用是给维基百科穿上漂亮的衣服，同时提供链接预览、页面收藏等增强功能。两者的界面风格几乎是两个极端。Wikiwand是灰白色调为主的现代风格，提供平板和手机客户端，而Wiki2非常绚丽多彩，并且，Wiki2在每个维基页面还集成了Youtube搜索功能，能自动在维基百科页面中插入相关的Youtube视频。笔者个人更喜欢Wiki2。萝卜白菜各有所爱，各位自己选择一个更顺眼的吧。 ###Google学术搜索按钮这个插件是谷歌公司官方出品的，功能非常实用。当你打开某个期刊的文献页面的时候，点击这个插件的按钮，它能够自动显示页面中文献的谷歌学术搜索结果。如果有免费的PDF提供，就会有一个绿色按钮，点击即可免费下载文献，不需要你的学校购买相关的数据库。点击引号还可以直接输出参考文献的引用，非常方便。 #5. 写在后面 ###必要的硬件升级如果你的电脑还用着2G内存和机械硬盘，那么这篇文章其实对你不会有太大帮助。因为相对于优秀软件带来的便利，更多的时候，你得忍受令人不悦的卡顿。如果你无法保持一个愉悦的心情，效率的提升就无从谈起。我强烈推荐你升级到8G以上内存，并且至少将系统盘换成SSD。即使你的老板很抠门，需要你自己掏这笔钱（500元以内）。另外，如果你需要经常码字，我推荐你给自己装备一个机械键盘，它能让你爱上打字的感觉。如果你是土豪的话，直接上Filco吧。 ###付费软件的价值大部分好的软件是免费的，但是它们的增值服务是收费的。这也是绝大部分优秀软件公司的生存方式。中国用户在使用这些软件的时候，很少考虑购买增值服务。也有一些即使有购买的意愿，也会受到支付渠道的限制。虽然不是每个人都需要增值服务，但是我希望当你真的需要的时候，不要犹豫。 ###科学上网有一点无法否认，那就是目前科技创新和科学研究的第一大国是美国。本文中介绍的很多软件是美国公司开发的，然而由于众所周知的原因，某些时候你无法正常的使用这些软件。尤其在这些软件中内置了Google的服务的时候。所以备好一把好用的梯子是十分重要的。这样你就不必在急于访问一些网站的时候面对打不开的页面抓狂。关于梯子的选择，目前最快最稳定的方式是ShadowSocks，全平台覆盖，电脑端可以全局fanqiang，并且速度很快，甚至可以看Youtube高清直播。可惜SS一般需要购买付费账号，约一两百一年。如果你有相关的需求，可以考虑购买一个，能够省去很多烦恼。为了避免广告嫌疑，这里就不提供相关地址了。至于免费的服务则有很多，然而由于GFW自强不息的技术更新，往往不能长期保持有效，目前最有效的是XX-net和Lantern。 相关文章推荐 高效率科研神器——Build your organizing creativity 高效率科研神器——小软件、大能量 世上最强大的科研工具手册","categories":[],"tags":[]},{"title":"","slug":"【转载】在不违反法律的前提下，我们可以选择做一个坏人吗？","date":"2018-01-13T08:27:04.490Z","updated":"2018-01-13T08:26:52.000Z","comments":true,"path":"2018/01/13/【转载】在不违反法律的前提下，我们可以选择做一个坏人吗？/","link":"","permalink":"https://jerrynju.github.io/2018/01/13/【转载】在不违反法律的前提下，我们可以选择做一个坏人吗？/","excerpt":"","text":"作者：一竹链接：https://www.zhihu.com/question/28364310/answer/40548894来源：知乎著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。 问了这个问题之后，自己也深入了思考了一下，最后的结论居然有点逆天。前方高能，有人格黑化的风险，注意安全。没想到一下子篇幅写这么长。智商和情商不高的，请忘掉你看到的一切，直到你真的明白了为止。我并没有让你完全的抛弃道德，只是让你明白道德到底是一个什么样的东西，也无心去打击任何在道德上对自身追求完美的人。由于文章观点杀伤力过强，请确认是否要继续阅读，对于文章观点造成的任何心理不适，不承担任何责任。第一，道德是虚伪的，道德的本质就是一群人对另外一群人的侵犯。在符合法律的前提下，道德不构成考量的标准。首先来说说道德，道德肯定也是人类博弈进化的产物。原始社会的道德制度和现在社会的肯定不同，而道德是博弈均衡产物的一种语言化的表现。举个例子，原始社会，人人分配，带有私有财产肯定是不道德的。而奴隶社会，虐待奴隶是合法的，至少不会看起来那么不道德，但是我们现在人是完全难以接受。再后来封建社会，忠诚是第一要务，不忠肯定是不道德。那么资本主义社会，共产主义社会的道德模式也是不一样的，这个后期详细讨论。从前面的几条，我们可以看到，道德并不是稳定的一直不变的，甚至是完全相反的，道德并不代表正确，而是一种社会博弈的均衡，那么问题来了，什么控制着道德的具体标准呢？答案是统治者。原始社会，并没有严格的统治，但是部落酋长有一定的权利，但由于彼此关系太过于相互依赖，所以可以认为道德是全员决定的，而部落首领更具有影响力。奴隶社会，道德就是社会统治者决定的，大奴隶主等等。封建社会，道德就是君主决定的，他们的意志某种程度上就是道德的体现，直到他们被推翻。至于资本主义社会，社会主义社会，共产主义社会，这个我们后面讨论。由以上我们可以基本了解道德的决定着，就是统治者，那么道德的内容是怎么确定的呢？答案是维护统治者的利益。我们以封建社会为例，道德，三纲五常，天子为大等等，都是维护统治阶级利益的，当然也存在另一个因素就是叛乱，叛乱着往往也会选择现有的道德基准，为自己找到一个合适的理由进行叛乱。所以小老百姓说，王侯将相宁有种乎，是真他妈的不道德事情。在大部分人心中的道德律下这都是严重不道德的事情。而封建的道德系统在我们现在的社会也逐步瓦解，妇女不收迫害，男女平等成为主流。那么问题来了，资本主义和社会主义，共产主义的道德模式会是什么样子的呢？这个就比较烧脑了。真如前面所说，道德是统治者统治的工具，但是这也不是完全正确，严格来说是有实力的人决定道德的走向，而在前面的社会统治者是绝对的权利拥有者，但是现在社会就变得不太一样了，统治者被泛化，他并不是一个人，甚至也不仅仅是一个党派，有了各种利益集团的博弈。即使是被统治阶级，甚至也拥有了一定的话语权。举个例子就是同性恋，在之前同性恋都是不合法的，但是在一次次的游行，科普之后，有些地方同性恋是合法的了，一个不道德的事情变成道德事情了。从这个角度来分析道德的走向是几部不可能的啦，谁知道几年以后行什么风呢？无论哪一个社会，最根本的还是生产力决定生产关系，统治者的分析还是比较表象的一种分析。那么我们来研究一下未来社会的生产力和生产关系是什么，由于电子商务的发展，人类的社会模型已经发生了巨大的变化，而随着机器人的普及，还会发生更巨大的变化，表象上每一个人都是独立的个体，与他人捆绑越来越淡，所以出现了一个巨大的问题，那就是道德在未来的世界是不存在的。在未来的世界，每一个人的生产和消费都是由机器人来完成的。也就是说人与人之间的相互依存关系已经不存在了。不同观念的人可能会形成不同的圈子，但是不同圈子的人也没有很强的相互制约的能力，各种力量区域平衡，彼此博弈之后，相互不影响就是最大的道德。当然目前社会还没有进步到那种程度，父母还会给予很多的教条和束缚，道德依旧还是存在的，那是为了把你捆绑在利益集团之下和巩固利益集团的一种手段。更高级的博弈还没有展开。以现在为例，你有经济基础，可以做一个宅男，染黄毛，不洗澡，那都是你的自由，没有人可以干涉你，不犯法就行了。至于有人说，那对家人来说是不道德的啊，呵呵，问题的关键还是你经济基础的结构，如果都是你自己的钱，是不需要搭理他们的，当然你得养育你的父母。综上所述，道德本身是一个非常虚伪的事物，有没有道德感并不是评价一个人好坏的标准，比如说小三等等，那都不是事，只要你合法。为什么广大女性对小三深恶痛绝，因为他们同理心，把自己带入受害者角色，然后感受到巨大损失，所以对小三充满仇恨，但事实上爱不爱你，每个人都是自由的，结婚不是爱你的充分条件，甚至不是必要条件，只是大家想把他们放一起罢了，而对小三的讨伐，保护了大部分女性的权利，小三人数不占多数，而他们也借此侵犯了小三自由恋爱的权利。写完这些出了一身汗，不知道大家会说点什么，我也要静静啊。第二，我们为什么会有道德感的存在，是自然进化而形成的一种保护机制，从众大部分情况是安全的，因为你和大部分人站在一起，人多力量大，可以去讨伐别人。而这些机制被内化进入我们的基因，天然存在一套道德机制。大多数人不会深入的思考道德教条本身是否真的是正确的，大部分人从自身的角度思考问题，比如小三，在做小三之前会觉得小三是不道德的，但是做了小三以后，就会觉得那是真爱。所以说，自身利益和角色的变化，会直接影响自己的道德判断。而这是出于一种是自己处于正当化的自我保护机制，会利用大量的有利信息来证明自己的合理性，所以良心这东西是可以改变的。人本身就是一种自私的动物，或者大部分动物都追求自己利益最大化，由于相互竞争和制约，策略的选择和反复博弈，最终会到达一种平衡。这就是主流道德观。第三，即使道德本身是虚伪的，但我们还是不要公然挑战道德。在未来社会，可以没有道德观，但是现在还不到时候，面对道德制约，答案是厚黑学！厚黑学是一本奇书啊，在古代环境不是那么开放的年代还是挺有意思的，它的主题思想是，表面上迎合所有的主流道德观，价值观，骨子里的意思就是该干嘛干嘛。厚黑学共分三步功夫，第一步是“厚如城墙，黑如煤炭”。第二步是“厚而硬，黑而亮”。第三步是“厚而无形，黑而无色”。古文比较拗口，直白的意思，就是你要坏，但是坏的无影无形，当然这不是一本方法论的书，至于你要怎么样坏的无影无形，这个得自己研究去了。从博弈论的角度出发，这是最优的一种策略。表面上的合作可以促使对手选择合作，而当对手合作以后，你的背叛可以获得更多的利益。当然背叛也是有风险的，这会招来报复。所以你最好把你的背叛赌在大项目上！所以也教大家，不要随便相信别人，当你没有制约对手的时候，对手很可能会抛弃你。第四，为什么所有人都鼓吹道德呢？因为他人的道德对自己而言是一个最有利策略环境。向所有人鼓吹道德绝对不是为了改善社会整体环境，社会整体是一个没有生命和利益偏好的东西，这是一个系统平台，就像你不能说雨林比沙漠好一样。每一个人本质上都是自私和趋利避害的，那么自私的人不像他人表述，自己自私的价值理念而和别人谈论道德呢？从博弈论的角度出发，对手选择道德的方式对自己而言永远是最有利的。当对手选择道德的时候，自己选择道德或者背叛，收益都大于对手选择不道德的策略时自己所获得的收益。好了，现在大家终于可以理解为什么所有都鼓吹道德了吧，为了自己收益最大化！自然选择真是一个神奇的东西，在大部分人都没有认真思考的前提下，依然能做出最优的选择。第五人性本就自私。面对绝大部分的事情，你有意或者无意都在做着自身利益的权衡，有时候你没有察觉到，有时候你欺骗了自己，有时候你原谅的自己，最终在人群的博弈环境下，你做出了有利于自己的选择。这并不算自私，这是人性，而正是借着这样的机制，我们的祖先不断繁衍生息。而所有的文明和道德都是人群一次又一次的博弈。好了最后总结，世界没有正义，世界本质上是一个利益博弈的舞台。道德本身就是保护部分人利益的一种话语权，是利益的集合体，不代表正义。在人生的一些重大选择上，而面临教条制约你的时候，你可以看起来妥协，而选择更委婉有效的方式。当然这需要非常高的智商和情商。当然本质上法律也是博弈的结果，但是法律具有更强的普适性，是基于基本人权的考量，违反法律的代价是很高的，所以法律还是要好好遵守的。道德相较于法律就有很大的不稳定性，偏见，某种程度上只是一种观念，但是被强化了，成为了不成文的道德规范。在法律的框架下，道德就变得无足轻重了。生活中的勾心斗角每天都在发生。坏人不用我教，我是写特别给善良孩子看的，仅此而已。—————————————————————————————————————————————感谢大家的热烈讨论，至于小三问题，最后再做一点补充。小三上位的风险是很高的，第一，一次离婚，男人的道德水准是严重滑坡的，再次背叛你的概率激增。（有数据。）第二，前任是不会放过你的，危险性不好估计。第三，社会道德是不会放过你的。虽然道德是变迁的，但是道德在某一时期的制约是不会改变的。你挑战道德都是要付出代价的，尤其平衡性那么差的时候。我所说的道德变迁是，随着发展的进一步加深，对小三的态度是会改变的，而变迁的基础也是女性能力和经济水平提高，对婚姻本体的需求也不是那么大，彼此都没有很深的经济依赖。其实目前真正做小三的大多数是社会底层，他们也不会考虑那么多了。而小三问题另一方面是你伴侣的问题，你们婚姻本身是有问题的。你结婚的时候就找一个男性经济水平高过于你，对男性而言，他并没有亏欠你什么，你人老色衰，离婚概率是大的。找个努力的屌丝男是比较靠谱的，总之，结婚的时候，可以让男的感觉配不上你，等到人老色衰，价值不断缩水的时候，他会念及你的好。所谓的一报还一报策略。当然你别是暴脾气啊，直接把优势烧掉了。而你们既要古代男人优于女人的经济环境，又最求平等，其实很麻烦。经济基础和付出是相互制约的，一旦出现付出感的不平衡，婚姻是会有问题的。当然高级别的人一般不会找个小三给自己添堵，他们的眼力劲也是不错的。至少能看到这篇文章的，好好生活，相互扶持，不惧小三困扰。———————————————————–理科生版，给大家讲讲博弈论，以及道德在博弈论框架下的演化。第一个故事：囚徒困境一个有钱人被发现死于家中。警方抓获了两个犯罪嫌疑人并查获了赃物，但两人辩称说他们只是小偷，进屋时那个人已经死了。没有更多证据，调查陷入僵局。于是警方把两人分开，分别对他们说：如果你俩都不认罪，我只能判你盗窃，一年了事；如果你招了他没招，你算作立功，不用坐牢，而他得十五年。如果如果他招了你没招，那反过来。但如果他和你都认了，谋杀罪每人十年。嫌疑人X心想：如果Y不招，那么我也不招的话会判一年，我招了无罪释放。招了更划算。而如果Y招了，那我不招的话十五年，招了只有十年。还是招了更划算。显然我应该招啊。而嫌疑人Y当然也是这么想的。结果，两人都判了十年。任何一人改策略都只会让自己处境更糟，这便是一个纳什均衡。可是，如果从整体上看，最好的结果显然是两人都不招，各判一年。双方都是理性考虑谋求自己的最大利益，结果却是两人都遭遇了坏场景；无论是整体最好场景（各判一年）还是个人最好场景（直接释放）都不可能发生。这就是为何囚徒困境是个“困境”。每个人都很精明，最后怎么弄了这么个烂摊子？囚徒困境示意图（或者，“收益矩阵”）。图片来源：Encyclopaedia Britannica按照囚徒困境术语，不招的行为算作“合作”（和你的狱友合作，不是和警方合作），而招认的行为算作“背叛”。双方都合作最好，双方都背叛则两败俱伤。按照这个故事，合作根本不可能出现啊。现实中类似囚徒困境的场景常常出现。但是，更多的结局似乎是合作，而不是背叛。为什么？可能的原因是，困境不止这一次。第二个故事：重复囚徒博弈如果嫌疑人X和Y是陌生人，那么两人的下场都是十年。但是他们也许是两肋插刀的好哥们，或者有血亲，或者属于同一个组织——总而言之，用博弈论的术语，他们以前也许打过交道，将来还很可能继续打交道。这时，“合作”就不是什么难以想象的事情了吧。因此，一位名叫罗伯特·阿克斯罗德的政治学家在上世纪80年代初做了一个名垂青史的实验。他在计算机里摆了一场锦标赛，有很多名虚拟的参赛选手，双方捉对厮杀——哦不，是捉对进行重复囚徒博弈。按照博弈的结果记分，你背叛他合作，则你得5分他得0分，双方都合作各得3分，双方都背叛各得1分。然后，他向全世界征集策略，每一个得到的策略变成一个参赛选手。提交的策略共有14个，来自经济学、社会学、政治学和数学等等领域，再加上一个“完全随机”的对照策略，共15“人”进行比赛。这里面有些策略极其复杂极其精妙，比如有一个策略用马尔科夫过程为对方的行为建立模型，然后用贝叶斯推断最好的选择。但是，最后得分最高的竟然是所有提交策略里最简单的一个——“一报还一报”（TFT, tit for tat）。这个策略一共只有两条规则：（1）第一步先合作，（2）从第二步开始，对方上一轮出的是什么，我就出什么。提交这个策略的是维也纳的安纳托·拉伯波特，他写这个策略只用了4行BASIC代码。阿克斯罗德发表了锦标赛的分析结果，并邀请大家吸取经验教训提交新一轮策略——这次他获得了62个策略，不但有上面提到的领域，还包括了演化生物学、物理学和计算科学等新学科。只有一个人厚颜无耻地原样提交了上次的卫冕冠军，那就是拉伯波特本人。你猜对了。他又一次获得了胜利。TFT这个“报仇者”成功的秘诀并不复杂。阿克斯罗德说，它有三个要素：它第一轮总是合作，先表示善意；它会惩罚背叛者；如果对方改过自新，它也不会咬住不放。但是甘地说过：“以眼还眼，举世皆盲。”现实中总会因为各种原因结下仇怨，但我们也没有从此冤冤相报何时了。这又是为什么？可能是因为，现实本来也和阿克斯罗德的模型有些重大差别。第三个故事：有突变和自然选择的重复囚徒博弈（1）自然发现了宽恕阿克斯罗德锦标赛有两个重大缺陷。其一，双方的行为都是完美的，没有误会，没有失误，哪怕不知道对方想什么，至少知道对方做了什么。但现实里多少悲剧源于双方一开始的误会啊！这个重要因素显然不该忽略。其二，每一个策略的“环境”都是武断决定的。一个策略能否成功，和它身边别的策略如何有很大的关系。假如群体里全都是永远背叛者，那么报仇者完全占不到任何便宜。而阿克斯罗德锦标赛里的参赛选手都是人为提交的，这可不能说是有代表性的样本。因此，在阿克斯罗德实验的基础上，马丁·诺瓦克制定了一轮新的锦标赛：引入了自然选择。他不再邀请人类专家设计策略，而是规定了一个大小合适的策略空间，允许策略在里面进行“繁殖”和“突变”。每一轮得分高的策略后代多，得分低的没有后代甚至自己都消失掉，但每个后代的策略也都和自己有十分微小的差异。此外，每次行为都有一定的“误会”概率——本来我应该合作，但实际出手的却是背叛。一开始，故事的发展和上面一样。起始的一团糟很快被谁都不信任、每一局都背叛的“背叛者”横扫，但其中很快又出现了一小团一报还一报的“报仇者”。然后报仇者有很大的概率靠自己内部合作，反过来推倒背叛者。但是现在故事不会到此结束了。因为有误会。报仇者很擅长对付坏人。但是如果对方不是坏人，而是犯了错误的好人呢？报仇者太记仇，不会放过这一点，如果对方也是报仇者，那相互合作立刻会变成相互背叛，就要陷入冤冤相报何时了的永远循环之中了。这时，突变出现了“宽恕者”。它的策略学名叫“慷慨的一报还一报”（GTFT）。它的特点是，即使对方出了背叛，下一轮也有一定的概率选择合作，这样就可以挽救陷入无穷背叛的可能。在论文里，诺瓦克骄傲地宣布：“自然选择发现了宽恕”。显然，宽恕存在的前提是周围有足够多的好人（报仇者或者其他宽恕者）。如果周围都是坏蛋（背叛者），你的宽恕只会被别人利用。可好人太多了，又会有另一个问题。（2）历史的循环如果周围都是好人，大家其乐融融，那么最好别坏了人家心情，干脆做个滥好人得了！不管怎么样我都永远合作。这比报仇者和宽恕者对误会的忍受能力更强，宽恕者还有一定概率不原谅，滥好人则是永远原谅，立刻拉回合作的“正轨”，所以它的得分更高。这整个群体会逐渐变成都是滥好人——但是，坏人从未远去。群体里永远会因为突变而出现新的坏人。而一群只知道合作的滥好人，面对坏蛋那就是白花花的肥肉啊。很快无比成功的坏人会占据群体的大部分。于是，一切重新开始。这个坏人-&gt;报仇者-&gt;宽恕者-&gt;滥好人-&gt;回到坏人的循环是极其普遍的，而且它的普遍不止存在于博弈论模型里——好人合作打败了坏人，多年以后好人放松了警惕、坏人于是东山再起，这个叙事模型在各种故事传说里都十分普遍。至于这能否作为现实人类历史上战争和平循环的抽象表述，那就见仁见智了。（3）打破轮回？那么，我们注定只能面对这个无尽循环了吗？并非如此。诺瓦克的初代模型里，每个策略只能考虑上一轮对方出了什么。如果它不但考虑了对方，还考虑了自己呢？如果它关注的不是对方的策略，而是策略带来的结果呢？在改进之后的模型里，意外出现了一个新的稳定策略：“输则改之，赢则加勉”（WSLS, win-stay, lose-shift）。这策略很简单。如果我上一轮占了便宜（双方都合作，或者他合作了我背叛），那这一轮我继续上轮策略。如果我上一轮吃了亏（双方都背叛，或者我合作了他背叛），那这一轮我就换一种策略。换言之，这是一种“反思”型。当两个反思者相遇，它们大部分时间都合作。万一遭遇了噪音，那么下一轮双方都背叛；再下一轮双方又合作了。纠错延迟只有1回合。这一点比宽恕者更强，只比滥好人弱一点点。但反思者不怕滥好人。和滥好人打交道，开始双方都合作，但是早晚要出现误会导致反思者背叛，接下来……反思者发现滥好人不懂得报复。于是以后每一轮都是反思者背叛、滥好人合作，没有分辨力的后者遭到惨无人道的剥削而退出游戏。这样一个反思者组成的社会不会随着时间推移而“放松警惕”变成滥好人，当然也就不会遭受坏蛋的后续必然入侵。第四个故事：关于人类诺瓦克的本行可以算作是演化生物学家。他们关心的，是在一个自然选择的框架下，合作何以可能。这个框架认为，虽然动物的智力各不相同，但自然选择会将策略植入它们的大脑中。好的策略自然能流传，哪怕动物本身不理解这个策略为何好、甚至不知道自己正在执行一个策略。自然选择只在乎结果。而人和人的心智，也是自然选择的产物。如果他们的研究能部分解释动物界的博弈策略，恐怕也可以部分应用到人身上。最后总结一下，博弈论分析，“输则改之，赢着加冕”是人类的一种本能的优势策略，很有效。同样“一报还一报”也是非常有效的优势策略，对于这两种策略，我们都是自带的。——————————————————————————————————————————-2015.10.23最近感悟，人与人之间的博弈是多次循环的过程，做一个坏人本身没有太大的问题，但是长期而言并不利于自身长久的发展，所谓大道至简，大智若愚。蠢一点人，也许会被人占便宜，但更多也会获得一定的好感和更多的合作机会，反倒是精明的人，让人觉得不安。自然进化，让人类拥有了一套趋利避害，有效合作的机制，很多时候，只需要遵从本心即可。最后推荐给你报仇者的策略吧，最优策略也是本心。它第一轮总是合作，先表示善意；它会惩罚背叛者；如果对方改过自新，它也不会咬住不放。推荐阅读 做一个精致的利己主义者 - 哲学与心理学的小秘密 - 知乎专栏参考文献：[1]“石头剪刀布制胜策略”的研究，是浪费钱吗？[2]厚黑学_好搜百科","categories":[],"tags":[]},{"title":"","slug":"两种思维范式的转变","date":"2018-01-13T08:27:04.451Z","updated":"2018-01-13T08:26:52.000Z","comments":true,"path":"2018/01/13/两种思维范式的转变/","link":"","permalink":"https://jerrynju.github.io/2018/01/13/两种思维范式的转变/","excerpt":"","text":"","categories":[],"tags":[]}]}